<?xml version="1.0" ?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<title></title>
<meta http-equiv="content-type" content="text/html; charset=utf-8" />
<link rev="made" href="mailto:root@localhost" />
</head>

<body style="background-color: white">



<ul id="index">
  <li>
    <ul>
      <li><a href="#template_process">template_process</a></li>
      <li><a href="#message_process">message_process</a></li>
      <li><a href="#transliterate">transliterate</a></li>
      <li><a href="#filtrate">filtrate</a></li>
    </ul>
  </li>
  <li><a href="#Parsing-pages">Parsing pages</a></li>
  <li><a href="#POD-ERRORS">POD ERRORS</a></li>
</ul>

<h2 id="template_process">template_process</h2>

<p>&#x41E;&#x442;&#x440;&#x438;&#x441;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x432; &#x432;&#x44B;&#x432;&#x43E;&#x434; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D; Template Toolkit &#x441; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x430;&#x43C;&#x438;, &#x443;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x43D;&#x44B;&#x43C;&#x438; &#x43D;&#x430; &#x432;&#x445;&#x43E;&#x434;&#x435;.</p>

<p>&#x41D;&#x430; &#x432;&#x445;&#x43E;&#x434;&#x435; &#x43E;&#x431;&#x44F;&#x437;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E; &#x443;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x44C;: - &#x438;&#x43C;&#x44F; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x430;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x441;&#x442;&#x430;&#x43D;&#x435;&#x43C; &#x43E;&#x442;&#x440;&#x438;&#x441;&#x43E;&#x432;&#x44B;&#x432;&#x430;&#x442;&#x44C;; - &#x43D;&#x430;&#x431;&#x43E;&#x440; &#x434;&#x43E;&#x43F;&#x43E;&#x43B;&#x43D;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x445; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x43E;&#x432; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x430;;</p>

<p>&#x41D;&#x430; &#x432;&#x44B;&#x445;&#x43E;&#x434;&#x435; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x438;&#x442;&#x44C; (&#x438; &#x432;&#x441;&#x442;&#x440;&#x43E;&#x438;&#x442;&#x44C;) &#x440;&#x435;&#x437;&#x443;&#x43B;&#x44C;&#x442;&#x430;&#x442; &#x43E;&#x442;&#x440;&#x438;&#x441;&#x43E;&#x432;&#x43A;&#x438; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x430;;</p>

<h2 id="message_process">message_process</h2>

<p>&#x421;&#x43B;&#x443;&#x436;&#x438;&#x442; &#x434;&#x43B;&#x44F; &#x43E;&#x442;&#x440;&#x438;&#x441;&#x43E;&#x432;&#x43A;&#x438; &#x441;&#x43E;&#x43E;&#x431;&#x449;&#x435;&#x43D;&#x438;&#x44F; &#x43F;&#x43E; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x443;. &#x41D;&#x430; &#x432;&#x445;&#x43E;&#x434;&#x435; &#x443;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x44C; message_id &#x438; &#x43D;&#x430;&#x431;&#x43E;&#x440; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x43E;&#x432;. &#x412; &#x447;&#x438;&#x441;&#x43B;&#x435; &#x43F;&#x440;&#x43E;&#x447;&#x438;&#x445; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x43E;&#x432; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x444;&#x43B;&#x430;&#x433; flash, &#x442;&#x43E;&#x433;&#x434;&#x430; &#x43E;&#x442;&#x440;&#x438;&#x441;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x44B;&#x439; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D; &#x431;&#x443;&#x434;&#x435;&#x442; &#x430;&#x432;&#x442;&#x43E;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x43B;&#x435;&#x43D; &#x43A; &#x432;&#x441;&#x43F;&#x43B;&#x44B;&#x432;&#x430;&#x44E;&#x449;&#x438;&#x43C; &#x441;&#x43E;&#x43E;&#x431;&#x449;&#x435;&#x43D;&#x438;&#x44F;&#x43C;; &#x438; &#x444;&#x43B;&#x430;&#x433; log - &#x441;&#x441;&#x44B;&#x43B;&#x43A;&#x430; &#x43D;&#x430; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D; &#x431;&#x443;&#x434;&#x435;&#x442; &#x434;&#x43E;&#x431;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x430; &#x432; &#x43E;&#x431;&#x449;&#x438;&#x439; &#x43B;&#x43E;&#x433;.</p>

<h2 id="transliterate">transliterate</h2>

<p>&#x422;&#x440;&#x430;&#x43D;&#x441;&#x43B;&#x438;&#x442;&#x435;&#x440;&#x430;&#x446;&#x438;&#x44F; &#x440;&#x443;&#x441;&#x441;&#x43A;&#x43E;&#x439; &#x441;&#x442;&#x440;&#x43E;&#x43A;&#x438; &#x432; &#x430;&#x43D;&#x433;&#x43B;&#x438;&#x439;&#x441;&#x43A;&#x443;&#x44E; &#x440;&#x430;&#x441;&#x43A;&#x43B;&#x430;&#x434;&#x43A;&#x443; &#x441;&#x43E;&#x433;&#x43B;&#x430;&#x441;&#x43D;&#x43E; &#x413;&#x41E;&#x421;&#x422;.</p>

<h2 id="filtrate">filtrate</h2>

<p>&#x424;&#x438;&#x43B;&#x44C;&#x442;&#x440;&#x443;&#x435;&#x442; &#x43D;&#x435;&#x43D;&#x443;&#x436;&#x43D;&#x44B;&#x435; &#x441;&#x43F;&#x435;&#x446;&#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x44B; &#x432; &#x438;&#x43C;&#x435;&#x43D;&#x430;&#x445;. &#x414;&#x43E;&#x43F;&#x43E;&#x43B;&#x43D;&#x44F;&#x435;&#x442; &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x434;&#x443;&#x440;&#x443; transliterate &#x434;&#x43B;&#x44F; &#x430;&#x432;&#x442;&#x43E;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x435;&#x43E;&#x431;&#x440;&#x430;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x438;&#x43C;&#x435;&#x43D;&#x438; &#x441;&#x442;&#x430;&#x442;&#x44C;&#x438;.</p>

<h1 id="Parsing-pages">Parsing pages</h1>

<h1 id="POD-ERRORS">POD ERRORS</h1>

<p>Hey! <b>The above document had some coding errors, which are explained below:</b></p>

<dl>

<dt id="Around-line-27">Around line 27:</dt>
<dd>

<p>Non-ASCII character seen before =encoding in &#39;&#x41E;&#x442;&#x440;&#x438;&#x441;&#x43E;&#x432;&#x430;&#x442;&#x44C;&#39;. Assuming UTF-8</p>

</dd>
</dl>


</body>

</html>


