<?xml version="1.0" ?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<title></title>
<meta http-equiv="content-type" content="text/html; charset=utf-8" />
<link rev="made" href="mailto:root@localhost" />
</head>

<body style="background-color: white">



<ul id="index">
  <li><a href="#">&#x41E;&#x431;&#x449;&#x438;&#x435; &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x434;&#x443;&#x440;&#x44B;</a>
    <ul>
      <li><a href="#img_fileparse">img_fileparse</a></li>
      <li><a href="#img_resize_list">img_resize_list</a></li>
      <li><a href="#destination-folder">destination folder</a></li>
      <li><a href="#img_relative_folder">img_relative_folder</a></li>
      <li><a href="#img_resize_by_rules">img_resize_by_rules</a></li>
      <li><a href="#img_convert_name">img_convert_name</a></li>
    </ul>
  </li>
  <li><a href="#POD-ERRORS">POD ERRORS</a></li>
</ul>

<h1 id="">&#x41E;&#x431;&#x449;&#x438;&#x435; &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x434;&#x443;&#x440;&#x44B;</h1>

<p>&#x41F;&#x440;&#x43E;&#x446;&#x435;&#x434;&#x443;&#x440;&#x44B;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x435; &#x443;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x44F;&#x44E;&#x442; &#x438;&#x437;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x438;&#x44F;&#x43C;&#x438; &#x440;&#x435;&#x448;&#x435;&#x43D;&#x43E; &#x432;&#x44B;&#x43D;&#x435;&#x441;&#x442;&#x438; &#x432; &#x43E;&#x442;&#x434;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C; &#x434;&#x43B;&#x44F; &#x443;&#x43F;&#x440;&#x43E;&#x449;&#x435;&#x43D;&#x438;&#x44F; &#x43B;&#x43E;&#x433;&#x438;&#x43A;&#x438;.</p>

<h2 id="img_fileparse">img_fileparse</h2>

<p>&#x41F;&#x440;&#x43E;&#x446;&#x435;&#x434;&#x443;&#x440;&#x430; &#x43A;&#x43E;&#x440;&#x440;&#x435;&#x43A;&#x442;&#x43D;&#x43E; &#x440;&#x430;&#x437;&#x434;&#x435;&#x43B;&#x44F;&#x435;&#x442; &#x43F;&#x43E;&#x43B;&#x43D;&#x44B;&#x439; &#x43F;&#x443;&#x442;&#x44C; &#x43A; &#x444;&#x430;&#x439;&#x43B;&#x443; &#x43D;&#x430; &#x43F;&#x443;&#x442;&#x44C;, &#x444;&#x430;&#x439;&#x43B; &#x438; &#x440;&#x430;&#x441;&#x448;&#x438;&#x440;&#x435;&#x43D;&#x438;&#x435;.</p>

<p>&#x421;&#x447;&#x438;&#x442;&#x430;&#x435;&#x442;&#x441;&#x44F;, &#x447;&#x442;&#x43E; &#x440;&#x430;&#x441;&#x448;&#x438;&#x440;&#x435;&#x43D;&#x438;&#x435; &#x444;&#x430;&#x439;&#x43B;&#x430; &#x43D;&#x435; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x431;&#x44B;&#x442;&#x44C; &#x43C;&#x435;&#x43D;&#x44C;&#x448;&#x435; &#x434;&#x432;&#x443;&#x445; &#x438; &#x431;&#x43E;&#x43B;&#x44C;&#x448;&#x435; &#x447;&#x435;&#x442;&#x44B;&#x440;&#x451;&#x445; &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x43E;&#x432; (7z, docx, jpeg - &#x433;&#x440;&#x430;&#x43D;&#x438;&#x447;&#x43D;&#x44B;&#x435; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x438;). &#x412; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x43D;&#x43E;&#x439; &#x436;&#x435; &#x441;&#x432;&#x43E;&#x435;&#x439; &#x43C;&#x430;&#x441;&#x441;&#x435; &#x440;&#x430;&#x441;&#x448;&#x438;&#x440;&#x435;&#x43D;&#x438;&#x435; &#x438;&#x43C;&#x435;&#x435;&#x442; &#x434;&#x43B;&#x438;&#x43D;&#x443; 3 &#x441;&#x438;&#x43C;&#x432;&#x43E;&#x43B;&#x430; (jpg, png, doc, odt, ...). &#x415;&#x441;&#x43B;&#x438; &#x440;&#x430;&#x441;&#x448;&#x438;&#x440;&#x435;&#x43D;&#x438;&#x435; &#x43D;&#x435; &#x443;&#x434;&#x43E;&#x432;&#x43B;&#x435;&#x442;&#x432;&#x43E;&#x440;&#x44F;&#x435;&#x442; &#x44D;&#x442;&#x438;&#x43C; &#x443;&#x441;&#x43B;&#x43E;&#x432;&#x438;&#x435;&#x43C;, &#x442;&#x43E; &#x43E;&#x43D;&#x43E; &#x441;&#x447;&#x438;&#x442;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x43D;&#x435;&#x438;&#x437;&#x432;&#x435;&#x441;&#x442;&#x43D;&#x44B;&#x43C; - &#x434;&#x43E;&#x431;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x441;&#x443;&#x444;&#x444;&#x438;&#x43A;&#x441; &quot;.unk&quot;. &#x418;&#x43D;&#x442;&#x435;&#x440;&#x43F;&#x440;&#x435;&#x442;&#x430;&#x446;&#x438;&#x44F; &#x442;&#x430;&#x43A;&#x438;&#x445; &#x444;&#x430;&#x439;&#x43B;&#x43E;&#x432; - &#x43D;&#x430; &#x441;&#x43E;&#x432;&#x435;&#x441;&#x442;&#x438; &#x434;&#x440;&#x443;&#x433;&#x438;&#x445; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x435;&#x439; &#x441;&#x430;&#x439;&#x442;&#x430;.</p>

<p>&#x41D;&#x430; &#x432;&#x44B;&#x445;&#x43E;&#x434;&#x435; - &#x43C;&#x430;&#x441;&#x441;&#x438;&#x432; (&#x43F;&#x443;&#x442;&#x44C;, &#x444;&#x430;&#x439;&#x43B;, &#x440;&#x430;&#x441;&#x448;&#x438;&#x440;&#x435;&#x43D;&#x438;&#x435;).</p>

<h2 id="img_resize_list">img_resize_list</h2>

<p>&#x421;&#x444;&#x43E;&#x440;&#x43C;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x43F;&#x435;&#x440;&#x435;&#x447;&#x435;&#x43D;&#x44C; &#x440;&#x435;&#x441;&#x430;&#x439;&#x437;&#x43E;&#x432;. &#x41A;&#x430;&#x43A; &#x43C;&#x438;&#x43D;&#x438;&#x43C;&#x443;&#x43C; &#x442;&#x440;&#x438; &#x44F;&#x432;&#x43B;&#x44F;&#x44E;&#x442;&#x441;&#x44F; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x43D;&#x44B;&#x43C;&#x438;: - noresize - &#x434;&#x43B;&#x44F; &#x441;&#x43E;&#x445;&#x440;&#x430;&#x43D;&#x435;&#x43D;&#x438;&#x44F; &#x43E;&#x440;&#x438;&#x433;&#x438;&#x43D;&#x430;&#x43B;&#x430;, &#x444;&#x430;&#x439;&#x43B; &#x43A;&#x43E;&#x43F;&#x438;&#x440;&#x443;&#x435;&#x442;&#x441;&#x44F; &quot;&#x43A;&#x430;&#x43A; &#x435;&#x441;&#x442;&#x44C;&quot;; - small - &#x434;&#x43B;&#x44F; &#x432;&#x441;&#x442;&#x440;&#x430;&#x438;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x432; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x447;&#x43A;&#x443;; - thumb - &#x434;&#x43B;&#x44F; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x43D;&#x438;&#x44F; &#x433;&#x430;&#x43B;&#x435;&#x440;&#x435;&#x438; &#x43F;&#x440;&#x435;&#x432;&#x44C;&#x44E;&#x448;&#x435;&#x43A;;</p>

<p>&#x41D;&#x430; &#x432;&#x445;&#x43E;&#x434;&#x435; &#x441;&#x43B;&#x435;&#x434;&#x443;&#x435;&#x442; &#x443;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x44C; &#x43D;&#x430;&#x437;&#x432;&#x430;&#x43D;&#x438;&#x435; &#x433;&#x430;&#x43B;&#x435;&#x440;&#x435;&#x438;, &#x432; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x443;&#x44E; &#x43F;&#x440;&#x43E;&#x438;&#x441;&#x445;&#x43E;&#x434;&#x438;&#x442; &#x437;&#x430;&#x433;&#x440;&#x443;&#x437;&#x43A;&#x430; &#x438;&#x437;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x438;&#x44F;. &#x415;&#x441;&#x43B;&#x438; &#x442;&#x430;&#x43A;&#x430;&#x44F; &#x433;&#x430;&#x43B;&#x435;&#x440;&#x435;&#x44F; &#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x435;&#x43D;&#x430; &#x432; &#x43D;&#x430;&#x441;&#x442;&#x440;&#x43E;&#x439;&#x43A;&#x430;&#x445; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F;, &#x442;&#x43E; &#x432; &#x441;&#x43F;&#x438;&#x441;&#x43E;&#x43A; &#x431;&#x443;&#x434;&#x435;&#x442; &#x432;&#x43A;&#x43B;&#x44E;&#x447;&#x451;&#x43D; &#x434;&#x43E;&#x43F;&#x43E;&#x43B;&#x43D;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; &#x440;&#x435;&#x441;&#x430;&#x439;&#x437; &#x434;&#x43B;&#x44F; &#x443;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x43D;&#x44B;&#x445; &#x440;&#x430;&#x437;&#x43C;&#x435;&#x440;&#x43E;&#x432;;</p>

<p>&#x412; &#x43D;&#x430;&#x441;&#x442;&#x440;&#x43E;&#x439;&#x43A;&#x430;&#x445; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x431;&#x44B;&#x442;&#x44C; &#x443;&#x43A;&#x430;&#x437;&#x430;&#x43D; &#x441;&#x432;&#x43E;&#x439; &#x440;&#x430;&#x437;&#x43C;&#x435;&#x440; &#x43F;&#x440;&#x435;&#x432;&#x44C;&#x44E;&#x448;&#x435;&#x43A; &#x43D;&#x430; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x439;, &#x435;&#x441;&#x43B;&#x438; &#x434;&#x438;&#x437;&#x430;&#x439;&#x43D; &#x43F;&#x43E;&#x434;&#x440;&#x430;&#x437;&#x443;&#x43C;&#x435;&#x432;&#x430;&#x435;&#x442; &#x434;&#x440;&#x443;&#x433;&#x43E;&#x439; (&#x43D;&#x435; 100 &#x43D;&#x430; 100 &#x442;&#x43E;&#x447;&#x435;&#x43A;) &#x440;&#x430;&#x437;&#x43C;&#x435;&#x440; &#x43F;&#x440;&#x435;&#x432;&#x44C;&#x44E;&#x448;&#x435;&#x43A;.</p>

<p>&#x414;&#x435;&#x444;&#x43E;&#x43B;&#x442;&#x43D;&#x44B;&#x439; &#x440;&#x430;&#x437;&#x43C;&#x435;&#x440; &#x440;&#x435;&#x441;&#x430;&#x439;&#x437;&#x430; 800&#x445;600 &#x442;&#x43E;&#x447;&#x435;&#x43A;, &#x435;&#x441;&#x43B;&#x438; &#x438;&#x43D;&#x43E;&#x435; &#x43D;&#x435; &#x437;&#x430;&#x434;&#x430;&#x43D;&#x43E; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x43E;&#x43C; default &#x432; &#x441;&#x435;&#x43A;&#x446;&#x438;&#x438; &#x43D;&#x430;&#x441;&#x442;&#x440;&#x43E;&#x435;&#x43A; &#x43F;&#x43B;&#x430;&#x433;&#x438;&#x43D;&#x430; gallery (plugins-&gt;gallery-&gt;default: ...).</p>

<h2 id="destination-folder">destination folder</h2>

<p>&#x41F;&#x43E;&#x43B;&#x443;&#x447;&#x438;&#x442;&#x44C; &#x430;&#x431;&#x441;&#x43E;&#x43B;&#x44E;&#x442;&#x43D;&#x44B;&#x439; &#x43F;&#x443;&#x442;&#x44C; &#x43A; &#x43F;&#x430;&#x43F;&#x43A;&#x435;, &#x432; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x443;&#x44E; &#x441;&#x43A;&#x43B;&#x430;&#x434;&#x44B;&#x432;&#x430;&#x44E;&#x442;&#x441;&#x44F; &#x440;&#x438;&#x441;&#x443;&#x43D;&#x43A;&#x438;. &#x421;&#x447;&#x438;&#x442;&#x430;&#x435;&#x442;&#x441;&#x44F;, &#x447;&#x442;&#x43E; &#x43F;&#x440;&#x430;&#x432;&#x430; &#x43F;&#x430;&#x43F;&#x43A;&#x438; &#x43F;&#x43E;&#x437;&#x432;&#x43E;&#x43B;&#x44F;&#x44E;&#x442; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x432;&#x430;&#x442;&#x44C; &#x432; &#x43D;&#x435;&#x439; &#x43F;&#x43E;&#x434;&#x43F;&#x430;&#x43F;&#x43A;&#x438;. &#x415;&#x441;&#x43B;&#x438; &#x442;&#x440;&#x435;&#x431;&#x443;&#x435;&#x43C;&#x43E;&#x439; &#x43F;&#x43E;&#x434;&#x43F;&#x430;&#x43F;&#x43A;&#x438; &#x43D;&#x435; &#x441;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x443;&#x435;&#x442;, &#x431;&#x443;&#x434;&#x435;&#x442; &#x43F;&#x440;&#x43E;&#x438;&#x437;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x430; &#x43F;&#x43E;&#x43F;&#x44B;&#x442;&#x43A;&#x430; &#x435;&#x451; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x43D;&#x438;&#x44F;.</p>

<h2 id="img_relative_folder">img_relative_folder</h2>

<p>&#x410;&#x431;&#x441;&#x43E;&#x43B;&#x44E;&#x442;&#x43D;&#x44B;&#x439; &#x43F;&#x443;&#x442;&#x44C; &#x43A; &#x43F;&#x430;&#x43F;&#x43A;&#x435; &#x434;&#x43E;&#x43F;&#x443;&#x441;&#x442;&#x438;&#x43C; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x43F;&#x43E;&#x43A;&#x430; &#x43F;&#x440;&#x43E;&#x438;&#x441;&#x445;&#x43E;&#x434;&#x438;&#x442; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x430; &#x441; &#x444;&#x430;&#x439;&#x43B;&#x430;&#x43C;&#x438;. &#x41F;&#x440;&#x438; &#x437;&#x430;&#x43F;&#x438;&#x441;&#x438; &#x440;&#x438;&#x441;&#x443;&#x43D;&#x43A;&#x430; &#x432; &#x411;&#x414; &#x442;&#x440;&#x435;&#x431;&#x443;&#x435;&#x442;&#x441;&#x44F; &#x43E;&#x442;&#x43D;&#x43E;&#x441;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; &#x43F;&#x443;&#x442;&#x44C;.</p>

<h2 id="img_resize_by_rules">img_resize_by_rules</h2>

<p>&#x41F;&#x440;&#x438;&#x43D;&#x446;&#x438;&#x43F; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x44B; &#x441; &#x438;&#x437;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x438;&#x435;&#x43C; &#x442;&#x430;&#x43A;&#x43E;&#x432;:</p>

<p>- &#x441;&#x442;&#x43E;&#x440;&#x43E;&#x43D;&#x43D;&#x435;&#x439; &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x434;&#x443;&#x440;&#x43E;&#x439; &#x43D;&#x430; &#x441;&#x435;&#x440;&#x432;&#x435;&#x440; &#x437;&#x430;&#x433;&#x440;&#x443;&#x436;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x438;&#x437;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x438;&#x435;;</p>

<p>- &#x44D;&#x442;&#x43E;&#x439; &#x436;&#x435; &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x434;&#x443;&#x440;&#x43E;&#x439; &#x441;&#x441;&#x44B;&#x43B;&#x43A;&#x430; &#x43D;&#x430; &#x438;&#x437;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x438;&#x435; &#x43F;&#x440;&#x43E;&#x43F;&#x438;&#x441;&#x44B;&#x432;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x432; &#x411;&#x414;;</p>

<p>- &#x444;&#x43E;&#x440;&#x43C;&#x438;&#x440;&#x443;&#x435;&#x442;&#x441;&#x44F; &#x441;&#x43F;&#x438;&#x441;&#x43E;&#x43A; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B; &#x43F;&#x440;&#x435;&#x43E;&#x431;&#x440;&#x430;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x438;&#x437;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x438;&#x44F;;</p>

<p>- &#x432;&#x44B;&#x437;&#x44B;&#x432;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x44D;&#x442;&#x430; &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x434;&#x443;&#x440;&#x430;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x430;&#x44F; &#x43F;&#x43E; &#x437;&#x430;&#x434;&#x430;&#x43D;&#x43D;&#x43E;&#x43C;&#x443; &#x441;&#x43F;&#x438;&#x441;&#x43A;&#x443; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B; &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x44F;&#x435;&#x442; &#x440;&#x435;&#x441;&#x430;&#x439;&#x437; &#x438;&#x437;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x438;&#x439;</p>

<p>&#x412; &#x43A;&#x430;&#x447;&#x435;&#x441;&#x442;&#x432;&#x435; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x43E;&#x432; &#x43D;&#x430; &#x432;&#x445;&#x43E;&#x434;&#x435; &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x434;&#x443;&#x440;&#x430; &#x43F;&#x440;&#x438;&#x43D;&#x438;&#x43C;&#x430;&#x435;&#x442; &#x441;&#x43B;&#x435;&#x434;&#x443;&#x44E;&#x449;&#x438;&#x435; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x44B;:</p>

<p>- &#x441;&#x441;&#x44B;&#x43B;&#x43A;&#x430; (&#x43F;&#x443;&#x442;&#x44C;) &#x43A; &#x444;&#x430;&#x439;&#x43B;&#x443;-&#x43E;&#x440;&#x438;&#x433;&#x438;&#x43D;&#x430;&#x43B;&#x443;;</p>

<p>- &#x442;&#x438;&#x43F; (&#x43D;&#x430;&#x437;&#x432;&#x430;&#x43D;&#x438;&#x435;) &#x433;&#x430;&#x43B;&#x435;&#x440;&#x435;&#x438;, &#x43A; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x43E;&#x439; &#x431;&#x443;&#x434;&#x435;&#x442; &#x43E;&#x442;&#x43D;&#x43E;&#x441;&#x438;&#x442;&#x44C;&#x441;&#x44F; &#x44D;&#x442;&#x43E;&#x442; &#x444;&#x430;&#x439;&#x43B;;</p>

<p>- &#x441;&#x43F;&#x438;&#x441;&#x43E;&#x43A; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B; &#x43F;&#x440;&#x435;&#x43E;&#x431;&#x440;&#x430;&#x437;&#x43E;&#x432;&#x430;&#x43D;&#x438;&#x44F; &#x434;&#x43B;&#x44F; &#x443;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x43D;&#x43E;&#x439; &#x433;&#x430;&#x43B;&#x435;&#x440;&#x435;&#x438;.</p>

<p>&#x415;&#x441;&#x43B;&#x438; &#x441;&#x43F;&#x438;&#x441;&#x43E;&#x43A; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435;&#x442; &#x437;&#x430;&#x434;&#x430;&#x43D;, &#x442;&#x43E; &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x434;&#x443;&#x440;&#x430; &#x432;&#x44B;&#x447;&#x438;&#x441;&#x43B;&#x438;&#x442; &#x435;&#x433;&#x43E; &#x434;&#x43B;&#x44F; &#x443;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x43D;&#x43E;&#x439; &#x43D;&#x430; &#x432;&#x445;&#x43E;&#x434;&#x435; &#x433;&#x430;&#x43B;&#x435;&#x440;&#x435;&#x438;.</p>

<p>&#x415;&#x441;&#x43B;&#x438; &#x433;&#x430;&#x43B;&#x435;&#x440;&#x435;&#x44F; &#x43D;&#x435; &#x431;&#x443;&#x434;&#x435;&#x442; &#x443;&#x43A;&#x430;&#x437;&#x430;&#x43D;&#x430; &#x44F;&#x432;&#x43D;&#x43E;, &#x442;&#x43E; &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x434;&#x443;&#x440;&#x430; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x442; &#x43E;&#x431;&#x449;&#x443;&#x44E; &#x433;&#x430;&#x43B;&#x435;&#x440;&#x435;&#x44E; &#x441; &#x438;&#x43C;&#x435;&#x43D;&#x435;&#x43C; &quot;common&quot;.</p>

<p>&#x415;&#x441;&#x43B;&#x438; &#x438;&#x437;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x438;&#x435; &#x43D;&#x435; &#x441;&#x447;&#x438;&#x442;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x433;&#x440;&#x430;&#x444;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438;&#x43C;, &#x442;&#x43E; &#x432;&#x441;&#x435;&#x433;&#x434;&#x430; &#x431;&#x443;&#x434;&#x435;&#x442; &#x441;&#x43E;&#x437;&#x434;&#x430;&#x43D; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x43E;&#x440;&#x438;&#x433;&#x438;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; &#x444;&#x430;&#x439;&#x43B; (&#x431;&#x435;&#x437; &#x433;&#x440;&#x430;&#x444;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x43E;&#x439; &#x43E;&#x431;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x43A;&#x438;).</p>

<h2 id="img_convert_name">img_convert_name</h2>

<p>&#x41F;&#x440;&#x435;&#x43E;&#x431;&#x440;&#x430;&#x437;&#x443;&#x435;&#x442; &#x438;&#x43C;&#x44F; &#x444;&#x430;&#x439;&#x43B;&#x430;, &#x434;&#x43E;&#x431;&#x430;&#x432;&#x43B;&#x44F;&#x44F; &#x43F;&#x43E;&#x441;&#x43B;&#x435; &#x438;&#x43C;&#x435;&#x43D;&#x438; &#x441;&#x443;&#x444;&#x444;&#x438;&#x43A;&#x441; &#x442;&#x438;&#x43F;&#x430; &#x444;&#x430;&#x439;&#x43B;&#x430;.</p>

<p>&#x415;&#x441;&#x43B;&#x438; &#x438;&#x437;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x438;&#x435; &#x43D;&#x435; &#x441;&#x447;&#x438;&#x442;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x433;&#x440;&#x430;&#x444;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438;&#x43C;, &#x442;&#x43E; &#x432;&#x441;&#x435;&#x433;&#x434;&#x430; &#x431;&#x443;&#x434;&#x435;&#x442; &#x432;&#x43E;&#x437;&#x432;&#x440;&#x430;&#x449;&#x435;&#x43D;&#x430; &#x441;&#x441;&#x44B;&#x43B;&#x43A;&#x430; &#x43D;&#x430; &#x43E;&#x440;&#x438;&#x433;&#x438;&#x43D;&#x430;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; &#x444;&#x430;&#x439;&#x43B;.</p>

<h1 id="POD-ERRORS">POD ERRORS</h1>

<p>Hey! <b>The above document had some coding errors, which are explained below:</b></p>

<dl>

<dt id="Around-line-25">Around line 25:</dt>
<dd>

<p>Non-ASCII character seen before =encoding in &#39;&#x41E;&#x431;&#x449;&#x438;&#x435;&#39;. Assuming UTF-8</p>

</dd>
</dl>


</body>

</html>


