<?xml version="1.0" ?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<title></title>
<meta http-equiv="content-type" content="text/html; charset=utf-8" />
<link rev="made" href="mailto:kevin@archlinux.org" />
</head>

<body style="background-color: white">



<ul id="index">
  <li><a href="#NAME">NAME</a></li>
  <li><a href="#VERSION">VERSION</a></li>
  <li><a href="#SYNOPSIS">SYNOPSIS</a></li>
  <li><a href="#DESCRIPTION">DESCRIPTION</a>
    <ul>
      <li><a href="#fawConvertPath">fawConvertPath</a></li>
      <li><a href="#fawform">fawform</a></li>
    </ul>
  </li>
</ul>

<h1 id="NAME">NAME</h1>

<p>Dancer::Plugin::FAW - Form Advanced Way</p>

<h1 id="VERSION">VERSION</h1>

<p>0.2</p>

<h1 id="SYNOPSIS">SYNOPSIS</h1>

<p>&#x41F;&#x43E;&#x441;&#x43B;&#x435; &#x43F;&#x43E;&#x434;&#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43D;&#x438;&#x44F; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F; &#x43C;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x43C; &#x434;&#x435;&#x43A;&#x43B;&#x430;&#x440;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x444;&#x43E;&#x440;&#x43C;&#x44B; &#x432; &#x43E;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x43C; &#x432;&#x438;&#x434;&#x435; &#x432; &#x43A;&#x43E;&#x434;&#x435; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43C;&#x44B;. &#x41F;&#x440;&#x435;&#x438;&#x43C;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x43E; &#x43F;&#x43E;&#x434;&#x445;&#x43E;&#x434;&#x430;: &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x44C; &#x431;&#x44B;&#x441;&#x442;&#x440;&#x43E;&#x433;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x435;&#x43D;&#x438;&#x44F; &#x43F;&#x43E;&#x43B;&#x435;&#x439; &#x444;&#x43E;&#x440;&#x43C;&#x44B;, &#x43B;&#x43E;&#x433;&#x438;&#x43A;&#x438; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x44B; &#x441; &#x43F;&#x43E;&#x43B;&#x44F;&#x43C;&#x438;, &#x43F;&#x440;&#x43E;&#x432;&#x435;&#x440;&#x43E;&#x43A; &#x43F;&#x43E;&#x43B;&#x435;&#x439; &#x438; &#x43E;&#x442;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x438;&#x44F; &#x43F;&#x43E;&#x43B;&#x435;&#x439; &#x432; &#x411;&#x414; &#x432; &#x43E;&#x434;&#x43D;&#x43E;&#x43C; &#x43C;&#x435;&#x441;&#x442;&#x435;.</p>

<p>&#x417;&#x430;&#x434;&#x435;&#x43A;&#x43B;&#x430;&#x440;&#x438;&#x440;&#x443;&#x439;&#x442;&#x435; &#x43E;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x438;&#x435; &#x43D;&#x43E;&#x432;&#x43E;&#x439; &#x444;&#x43E;&#x440;&#x43C;&#x44B;</p>

<pre><code>    fawform &#39;/callback&#39; =&gt; {
        template    =&gt; &#39;callback-form&#39;,
        redirect    =&gt; &#39;&#39;,
        layout      =&gt; &#39;&#39;,
        formname    =&gt; &#39;&#39;,
        fields      =&gt; [ 
            { ... },
        ],
        buttons     =&gt; [
            { ... },
        ],
        before      =&gt; sub {
            ...
        },
        after       =&gt; sub {
            ...
        },
    };</code></pre>

<p>&#x420;&#x430;&#x441;&#x448;&#x438;&#x440;&#x44C;&#x442;&#x435; &#x43F;&#x43E;&#x43B;&#x44F; &#x444;&#x43E;&#x440;&#x43C;&#x44B; &#x432; &#x440;&#x430;&#x437;&#x434;&#x435;&#x43B;&#x435; fields &#x438; &#x43A;&#x43D;&#x43E;&#x43F;&#x43A;&#x438; &#x444;&#x43E;&#x440;&#x43C;&#x44B; &#x432; &#x440;&#x430;&#x437;&#x434;&#x435;&#x43B;&#x435; buttons, &#x43A;&#x430;&#x43A; &#x44D;&#x442;&#x43E; &#x43E;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x43E; &#x432; FAW::Forms.</p>

<p>&#x415;&#x441;&#x43B;&#x438; &#x44D;&#x442;&#x43E; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x43E;&#x434;&#x438;&#x43C;&#x43E;, &#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x438;&#x442;&#x435; &#x43B;&#x43E;&#x433;&#x438;&#x43A;&#x443; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x44B; &#x444;&#x43E;&#x440;&#x43C;&#x44B; &#x43F;&#x435;&#x440;&#x435;&#x434; &#x435;&#x451; &#x43E;&#x442;&#x440;&#x438;&#x441;&#x43E;&#x432;&#x43A;&#x43E;&#x439; (before): &#x437;&#x434;&#x435;&#x441;&#x44C; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x443;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x44F;&#x442;&#x44C; &#x43F;&#x440;&#x430;&#x432;&#x430;&#x43C;&#x438;, &#x440;&#x435;&#x430;&#x43B;&#x438;&#x437;&#x43E;&#x432;&#x44B;&#x432;&#x430;&#x442;&#x44C; &#x43F;&#x43E;&#x434;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43A;&#x443; &#x434;&#x435;&#x444;&#x43E;&#x43B;&#x442;&#x43D;&#x44B;&#x445; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x439; &#x432; &#x43F;&#x43E;&#x43B;&#x44F; &#x444;&#x43E;&#x440;&#x43C;&#x44B;.</p>

<p>&#x41E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x438;&#x442;&#x435; &#x43B;&#x43E;&#x433;&#x438;&#x43A;&#x443; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x44B; &#x444;&#x43E;&#x440;&#x43C;&#x44B; &#x43F;&#x43E;&#x441;&#x43B;&#x435; &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x43A;&#x438; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x445; (after): &#x43A;&#x443;&#x434;&#x430; &#x438; &#x43A;&#x430;&#x43A;&#x438;&#x43C; &#x43E;&#x431;&#x440;&#x430;&#x437;&#x43E;&#x43C; &#x431;&#x443;&#x434;&#x443;&#x442; &#x43F;&#x43E;&#x43C;&#x435;&#x449;&#x435;&#x43D;&#x44B; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x435;; &#x43A;&#x443;&#x434;&#x430; &#x431;&#x443;&#x434;&#x435;&#x442; &#x441;&#x43E;&#x432;&#x435;&#x440;&#x448;&#x451;&#x43D; &#x43F;&#x435;&#x440;&#x435;&#x445;&#x43E;&#x434; (&#x435;&#x441;&#x43B;&#x438; &#x43E;&#x43D; &#x43E;&#x442;&#x43B;&#x438;&#x447;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x43E;&#x442; &#x437;&#x430;&#x434;&#x430;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x432; &#x43F;&#x43E;&#x43B;&#x435; redirect &#x432; &#x437;&#x430;&#x432;&#x438;&#x441;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x438; &#x43E;&#x442; &#x443;&#x441;&#x43B;&#x43E;&#x432;&#x438;&#x439; &#x444;&#x43E;&#x440;&#x43C;&#x44B;); &#x43A;&#x430;&#x43A;&#x438;&#x435; &#x434;&#x43E;&#x43F;&#x43E;&#x43B;&#x43D;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x435; &#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x44F; &#x434;&#x43E;&#x43B;&#x436;&#x43D;&#x430; &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x438;&#x442;&#x44C; &#x43B;&#x43E;&#x433;&#x438;&#x43A;&#x430; &#x432; &#x442;&#x43E;&#x43C; &#x438;&#x43B;&#x438; &#x438;&#x43D;&#x43E;&#x43C; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435;.</p>

<h1 id="DESCRIPTION">DESCRIPTION</h1>

<p>&#x41C;&#x43E;&#x434;&#x443;&#x43B;&#x44C; &#x434;&#x43B;&#x44F; &#x43F;&#x440;&#x43E;&#x434;&#x432;&#x438;&#x43D;&#x443;&#x442;&#x43E;&#x433;&#x43E; &#x43E;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x438;&#x44F; &#x444;&#x43E;&#x440;&#x43C;. &#x421;&#x43A;&#x43B;&#x435;&#x438;&#x432;&#x430;&#x435;&#x442; FAW::Forms &#x438; Dancer &#x441; &#x443;&#x434;&#x43E;&#x431;&#x43D;&#x44B;&#x43C;&#x438; &#x434;&#x43E;&#x43F;&#x43E;&#x43B;&#x43D;&#x435;&#x43D;&#x438;&#x44F;&#x43C;&#x438;.</p>

<h2 id="fawConvertPath">fawConvertPath</h2>

<p>&#x41E;&#x434;&#x43D;&#x430; &#x438;&#x437; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x43D;&#x44B;&#x445; &#x437;&#x430;&#x434;&#x430;&#x447; - &#x43F;&#x440;&#x435;&#x43E;&#x431;&#x440;&#x430;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x442;&#x43E;&#x447;&#x43A;&#x443; &#x43E;&#x431;&#x449;&#x435;&#x433;&#x43E; &#x432;&#x438;&#x434;&#x430; &#x43A; &#x447;&#x430;&#x441;&#x442;&#x43D;&#x43E;&#x43C;&#x443;, &#x442;&#x43E; &#x435;&#x441;&#x442;&#x44C; &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x438;&#x442;&#x44C; &#x437;&#x430;&#x43C;&#x435;&#x43D;&#x443; &#x438; &#x43F;&#x43E;&#x434;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43A;&#x443; &#x43F;&#x43E;&#x43B;&#x435;&#x434;&#x435;&#x440;&#x436;&#x430;&#x442;&#x435;&#x43B;&#x435;&#x439; &#x43D;&#x430; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x44F; &#x43F;&#x43E;&#x43B;&#x435;&#x434;&#x435;&#x440;&#x436;&#x430;&#x442;&#x435;&#x43B;&#x435;&#x439;.</p>

<h2 id="fawform">fawform</h2>

<p>&#x427;&#x435;&#x440;&#x435;&#x437; &#x43E;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x438;&#x435; &#x444;&#x43E;&#x440;&#x43C;&#x44B; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x451;&#x442;&#x441;&#x44F; &#x440;&#x44F;&#x434; &#x434;&#x43E;&#x43F;&#x43E;&#x43B;&#x43D;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x445; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x43E;&#x432; &#x434;&#x43B;&#x44F; fawform:</p>

<p>- layout = &#x43E;&#x441;&#x43E;&#x431;&#x44B;&#x439; &#x43C;&#x430;&#x43A;&#x435;&#x442;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x431;&#x44B;&#x442;&#x44C; &#x43F;&#x435;&#x440;&#x435;&#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x451;&#x43D; &#x432;&#x43C;&#x435;&#x441;&#x442;&#x43E; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x43D;&#x43E;&#x433;&#x43E; &#x43C;&#x430;&#x43A;&#x435;&#x442;&#x430; &#x432;&#x44B;&#x432;&#x43E;&#x434;&#x430;. &#x41D;&#x435;&#x43E;&#x431;&#x44F;&#x437;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x439; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;, &#x435;&#x441;&#x43B;&#x438; &#x43D;&#x435; &#x443;&#x43A;&#x430;&#x437;&#x430;&#x43D;, &#x442;&#x43E; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x435;&#x442;&#x441;&#x44F; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x43D;&#x44B;&#x439; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;;</p>

<p>- template = &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;, &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x44E;&#x449;&#x438;&#x439;&#x441;&#x44F; &#x434;&#x43B;&#x44F; &#x432;&#x44B;&#x432;&#x43E;&#x434;&#x430; &#x444;&#x43E;&#x440;&#x43C;&#x44B;. &#x41E;&#x442;&#x440;&#x438;&#x441;&#x43E;&#x432;&#x43A;&#x430; &#x444;&#x43E;&#x440;&#x43C;&#x44B; &#x432;&#x435;&#x434;&#x451;&#x442;&#x441;&#x44F; &#x447;&#x435;&#x440;&#x435;&#x437; &#x44D;&#x442;&#x43E;&#x442; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;;</p>

<p>- before = &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x434;&#x443;&#x440;&#x430;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x430;&#x44F; &#x432;&#x44B;&#x437;&#x44B;&#x432;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x43F;&#x435;&#x440;&#x435;&#x434; &#x432;&#x430;&#x43B;&#x438;&#x434;&#x430;&#x446;&#x438;&#x435;&#x439; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x445; &#x438; &#x43E;&#x442;&#x440;&#x438;&#x441;&#x43E;&#x432;&#x43A;&#x43E;&#x439; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x430;. &#x412; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x445; &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x434;&#x443;&#x440;&#x44B; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x44E;&#x442;&#x441;&#x44F; &#x442;&#x438;&#x43F; &#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x44F; (get/post) &#x438; &#x442;&#x435;&#x43A;&#x443;&#x449;&#x438;&#x435; &#x441;&#x432;&#x43E;&#x439;&#x441;&#x442;&#x432;&#x430; &#x444;&#x43E;&#x440;&#x43C;&#x44B; (&#x445;&#x44D;&#x448; &#x43A;&#x43B;&#x430;&#x441;&#x441;&#x430; FAW::Form).</p>

<p>- after = &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x434;&#x443;&#x440;&#x430;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x430;&#x44F; &#x432;&#x44B;&#x437;&#x44B;&#x432;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x43F;&#x43E;&#x441;&#x43B;&#x435; &#x432;&#x430;&#x43B;&#x438;&#x434;&#x430;&#x446;&#x438;&#x438; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x445; &#x438; &#x43E;&#x442;&#x440;&#x438;&#x441;&#x43E;&#x432;&#x43A;&#x438; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x430;. &#x412; &#x430;&#x440;&#x433;&#x443;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x445; &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x434;&#x443;&#x440;&#x44B; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x44E;&#x442;&#x441;&#x44F; &#x442;&#x438;&#x43F; &#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x44F; (get/post) &#x438; &#x441;&#x43E;&#x434;&#x435;&#x440;&#x436;&#x438;&#x43C;&#x43E;&#x435; &#x43E;&#x442;&#x440;&#x438;&#x441;&#x43E;&#x432;&#x430;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x430;.</p>

<p>- redirect = &#x43D;&#x430; &#x43A;&#x430;&#x43A;&#x443;&#x44E; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x447;&#x43A;&#x443; &#x43F;&#x435;&#x440;&#x435;&#x439;&#x442;&#x438; &#x432; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435; &#x43F;&#x440;&#x438;&#x43D;&#x44F;&#x442;&#x438;&#x44F; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x445; &#x444;&#x43E;&#x440;&#x43C;&#x44B;.</p>

<p>&#x41F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440; &quot;action&quot; &#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x438;&#x442;&#x441;&#x44F; &#x43D;&#x435;&#x43E;&#x431;&#x44F;&#x437;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x43C; (&#x437;&#x430;&#x434;&#x430;&#x451;&#x442; &#x442;&#x43E;&#x447;&#x43A;&#x443; &#x441;&#x430;&#x439;&#x442;&#x430;, &#x43D;&#x430; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x443;&#x44E; &#x431;&#x443;&#x434;&#x443;&#x442; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x432;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x435; &#x444;&#x43E;&#x440;&#x43C;&#x44B;), &#x43F;&#x43E;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x443; &#x43E;&#x43D; &#x430;&#x432;&#x442;&#x43E;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438; &#x43F;&#x43E;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x43F;&#x440;&#x438; &#x432;&#x44B;&#x437;&#x43E;&#x432;&#x435; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x43E;&#x432; get/post.</p>

<p>&#x41F;&#x435;&#x440;&#x435;&#x43D;&#x430;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x435; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x443;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x44C; &#x44F;&#x432;&#x43D;&#x43E; &#x432; &#x445;&#x44D;&#x448;&#x435; $faw &#x438;&#x43B;&#x438; &#x432; &#x445;&#x44D;&#x448;&#x435; config &#x438;&#x43B;&#x438; &#x43D;&#x435; &#x443;&#x43A;&#x430;&#x437;&#x44B;&#x432;&#x430;&#x442;&#x44C;, &#x438; &#x43F;&#x435;&#x440;&#x435;&#x439;&#x442;&#x438; &#x43A; &#x43A;&#x43E;&#x440;&#x43D;&#x435;&#x432;&#x43E;&#x439; &#x442;&#x43E;&#x447;&#x43A;&#x435; (&#x43F;&#x443;&#x442;&#x44C; &quot;/&quot; = &#x438;&#x43D;&#x434;&#x435;&#x43A;&#x441;&#x43D;&#x430;&#x44F; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x447;&#x43A;&#x430;).</p>


</body>

</html>


