<?xml version="1.0" ?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<title></title>
<meta http-equiv="content-type" content="text/html; charset=utf-8" />
<link rev="made" href="mailto:kevin@archlinux.org" />
</head>

<body style="background-color: white">



<ul id="index">
  <li><a href="#NAME">NAME</a></li>
  <li><a href="#VERSION">VERSION</a></li>
  <li><a href="#SYNOPSIS">SYNOPSIS</a></li>
  <li><a href="#DESCRIPTION">DESCRIPTION</a>
    <ul>
      <li><a href="#fawConvertPath">fawConvertPath</a></li>
      <li><a href="#fawform">fawform</a></li>
    </ul>
  </li>
  <li><a href="#POD-ERRORS">POD ERRORS</a></li>
</ul>

<h1 id="NAME">NAME</h1>

<p>Dancer::Plugin::FAW - Form Advanced Way</p>

<h1 id="VERSION">VERSION</h1>

<p>0.2</p>

<h1 id="SYNOPSIS">SYNOPSIS</h1>

<p>&#x41F;&#x43E;&#x441;&#x43B;&#x435; &#x43F;&#x43E;&#x434;&#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43D;&#x438;&#x44F; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F; &#x43C;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x43C; &#x434;&#x435;&#x43A;&#x43B;&#x430;&#x440;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x444;&#x43E;&#x440;&#x43C;&#x44B; &#x432; &#x43E;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x43E;&#x43C; &#x432;&#x438;&#x434;&#x435; &#x432; &#x43A;&#x43E;&#x434;&#x435; &#x43F;&#x440;&#x43E;&#x433;&#x440;&#x430;&#x43C;&#x43C;&#x44B;. &#x41F;&#x440;&#x435;&#x438;&#x43C;&#x443;&#x449;&#x435;&#x441;&#x442;&#x432;&#x43E; &#x43F;&#x43E;&#x434;&#x445;&#x43E;&#x434;&#x430;: &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x44C; &#x431;&#x44B;&#x441;&#x442;&#x440;&#x43E;&#x433;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x435;&#x43D;&#x438;&#x44F; &#x43F;&#x43E;&#x43B;&#x435;&#x439; &#x444;&#x43E;&#x440;&#x43C;&#x44B;, &#x43B;&#x43E;&#x433;&#x438;&#x43A;&#x438; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x44B; &#x441; &#x43F;&#x43E;&#x43B;&#x44F;&#x43C;&#x438;, &#x43F;&#x440;&#x43E;&#x432;&#x435;&#x440;&#x43E;&#x43A; &#x43F;&#x43E;&#x43B;&#x435;&#x439; &#x438; &#x43E;&#x442;&#x43E;&#x431;&#x440;&#x430;&#x436;&#x435;&#x43D;&#x438;&#x44F; &#x43F;&#x43E;&#x43B;&#x435;&#x439; &#x432; &#x411;&#x414; &#x432; &#x43E;&#x434;&#x43D;&#x43E;&#x43C; &#x43C;&#x435;&#x441;&#x442;&#x435;.</p>

<p>&#x417;&#x430;&#x434;&#x435;&#x43A;&#x43B;&#x430;&#x440;&#x438;&#x440;&#x443;&#x439;&#x442;&#x435; &#x43E;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x438;&#x435; &#x43D;&#x43E;&#x432;&#x43E;&#x439; &#x444;&#x43E;&#x440;&#x43C;&#x44B;</p>

<pre><code>    fawform &#39;/callback&#39; =&gt; {
        template    =&gt; &#39;callback-form&#39;,
        redirect    =&gt; &#39;&#39;,
        layout      =&gt; &#39;&#39;,
        formname    =&gt; &#39;&#39;,
        fields      =&gt; [ 
            { ... },
        ],
        buttons     =&gt; [
            { ... },
        ],
        before      =&gt; sub {
            ...
        },
        after       =&gt; sub {
            ...
        },
    };</code></pre>

<p>&#x420;&#x430;&#x441;&#x448;&#x438;&#x440;&#x44C;&#x442;&#x435; &#x43F;&#x43E;&#x43B;&#x44F; &#x444;&#x43E;&#x440;&#x43C;&#x44B; &#x432; &#x440;&#x430;&#x437;&#x434;&#x435;&#x43B;&#x435; fields &#x438; &#x43A;&#x43D;&#x43E;&#x43F;&#x43A;&#x438; &#x444;&#x43E;&#x440;&#x43C;&#x44B; &#x432; &#x440;&#x430;&#x437;&#x434;&#x435;&#x43B;&#x435; buttons, &#x43A;&#x430;&#x43A; &#x44D;&#x442;&#x43E; &#x43E;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x43E; &#x432; FAW::Forms.</p>

<p>&#x415;&#x441;&#x43B;&#x438; &#x44D;&#x442;&#x43E; &#x43D;&#x435;&#x43E;&#x431;&#x445;&#x43E;&#x434;&#x438;&#x43C;&#x43E;, &#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x438;&#x442;&#x435; &#x43B;&#x43E;&#x433;&#x438;&#x43A;&#x443; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x44B; &#x444;&#x43E;&#x440;&#x43C;&#x44B; &#x43F;&#x435;&#x440;&#x435;&#x434; &#x435;&#x451; &#x43E;&#x442;&#x440;&#x438;&#x441;&#x43E;&#x432;&#x43A;&#x43E;&#x439; (before): &#x437;&#x434;&#x435;&#x441;&#x44C; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x443;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x44F;&#x442;&#x44C; &#x43F;&#x440;&#x430;&#x432;&#x430;&#x43C;&#x438;, &#x440;&#x435;&#x430;&#x43B;&#x438;&#x437;&#x43E;&#x432;&#x44B;&#x432;&#x430;&#x442;&#x44C; &#x43F;&#x43E;&#x434;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43A;&#x443; &#x434;&#x435;&#x444;&#x43E;&#x43B;&#x442;&#x43D;&#x44B;&#x445; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x439; &#x432; &#x43F;&#x43E;&#x43B;&#x44F; &#x444;&#x43E;&#x440;&#x43C;&#x44B;.</p>

<p>&#x41E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x438;&#x442;&#x435; &#x43B;&#x43E;&#x433;&#x438;&#x43A;&#x443; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x44B; &#x444;&#x43E;&#x440;&#x43C;&#x44B; &#x43F;&#x43E;&#x441;&#x43B;&#x435; &#x43E;&#x442;&#x43F;&#x440;&#x430;&#x432;&#x43A;&#x438; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x445; (after): &#x43A;&#x443;&#x434;&#x430; &#x438; &#x43A;&#x430;&#x43A;&#x438;&#x43C; &#x43E;&#x431;&#x440;&#x430;&#x437;&#x43E;&#x43C; &#x431;&#x443;&#x434;&#x443;&#x442; &#x43F;&#x43E;&#x43C;&#x435;&#x449;&#x435;&#x43D;&#x44B; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x435;; &#x43A;&#x443;&#x434;&#x430; &#x431;&#x443;&#x434;&#x435;&#x442; &#x441;&#x43E;&#x432;&#x435;&#x440;&#x448;&#x451;&#x43D; &#x43F;&#x435;&#x440;&#x435;&#x445;&#x43E;&#x434; (&#x435;&#x441;&#x43B;&#x438; &#x43E;&#x43D; &#x43E;&#x442;&#x43B;&#x438;&#x447;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x43E;&#x442; &#x437;&#x430;&#x434;&#x430;&#x43D;&#x43D;&#x43E;&#x433;&#x43E; &#x432; &#x43F;&#x43E;&#x43B;&#x435; redirect &#x432; &#x437;&#x430;&#x432;&#x438;&#x441;&#x438;&#x43C;&#x43E;&#x441;&#x442;&#x438; &#x43E;&#x442; &#x443;&#x441;&#x43B;&#x43E;&#x432;&#x438;&#x439; &#x444;&#x43E;&#x440;&#x43C;&#x44B;); &#x43A;&#x430;&#x43A;&#x438;&#x435; &#x434;&#x43E;&#x43F;&#x43E;&#x43B;&#x43D;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x435; &#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x44F; &#x434;&#x43E;&#x43B;&#x436;&#x43D;&#x430; &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x438;&#x442;&#x44C; &#x43B;&#x43E;&#x433;&#x438;&#x43A;&#x430; &#x432; &#x442;&#x43E;&#x43C; &#x438;&#x43B;&#x438; &#x438;&#x43D;&#x43E;&#x43C; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435;.</p>

<h1 id="DESCRIPTION">DESCRIPTION</h1>

<p>&#x41C;&#x43E;&#x434;&#x443;&#x43B;&#x44C; &#x434;&#x43B;&#x44F; &#x43F;&#x440;&#x43E;&#x434;&#x432;&#x438;&#x43D;&#x443;&#x442;&#x43E;&#x433;&#x43E; &#x43E;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x438;&#x44F; &#x444;&#x43E;&#x440;&#x43C;. &#x421;&#x43A;&#x43B;&#x435;&#x438;&#x432;&#x430;&#x435;&#x442; FAW::Forms &#x438; Dancer &#x441; &#x443;&#x434;&#x43E;&#x431;&#x43D;&#x44B;&#x43C;&#x438; &#x434;&#x43E;&#x43F;&#x43E;&#x43B;&#x43D;&#x435;&#x43D;&#x438;&#x44F;&#x43C;&#x438;.</p>

<h2 id="fawConvertPath">fawConvertPath</h2>

<p>&#x41E;&#x434;&#x43D;&#x430; &#x438;&#x437; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x43D;&#x44B;&#x445; &#x437;&#x430;&#x434;&#x430;&#x447; - &#x43F;&#x440;&#x435;&#x43E;&#x431;&#x440;&#x430;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x442;&#x43E;&#x447;&#x43A;&#x443; &#x43E;&#x431;&#x449;&#x435;&#x433;&#x43E; &#x432;&#x438;&#x434;&#x430; &#x43A; &#x447;&#x430;&#x441;&#x442;&#x43D;&#x43E;&#x43C;&#x443;, &#x442;&#x43E; &#x435;&#x441;&#x442;&#x44C; &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x438;&#x442;&#x44C; &#x437;&#x430;&#x43C;&#x435;&#x43D;&#x443; &#x438; &#x43F;&#x43E;&#x434;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43A;&#x443; &#x43F;&#x43E;&#x43B;&#x435;&#x434;&#x435;&#x440;&#x436;&#x430;&#x442;&#x435;&#x43B;&#x435;&#x439; &#x43D;&#x430; &#x437;&#x43D;&#x430;&#x447;&#x435;&#x43D;&#x438;&#x44F; &#x43F;&#x43E;&#x43B;&#x435;&#x434;&#x435;&#x440;&#x436;&#x430;&#x442;&#x435;&#x43B;&#x435;&#x439;.</p>

<h2 id="fawform">fawform</h2>

<p>&#x427;&#x435;&#x440;&#x435;&#x437; &#x43E;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x438;&#x435; &#x444;&#x43E;&#x440;&#x43C;&#x44B; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x451;&#x442;&#x441;&#x44F; &#x440;&#x44F;&#x434; &#x434;&#x43E;&#x43F;&#x43E;&#x43B;&#x43D;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x445; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x43E;&#x432; &#x434;&#x43B;&#x44F; fawform:</p>

<p>- template = &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;, &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x44E;&#x449;&#x438;&#x439;&#x441;&#x44F; &#x434;&#x43B;&#x44F; &#x432;&#x44B;&#x432;&#x43E;&#x434;&#x430; &#x444;&#x43E;&#x440;&#x43C;&#x44B;. &#x41E;&#x442;&#x440;&#x438;&#x441;&#x43E;&#x432;&#x43A;&#x430; &#x444;&#x43E;&#x440;&#x43C;&#x44B; &#x432;&#x435;&#x434;&#x451;&#x442;&#x441;&#x44F; &#x447;&#x435;&#x440;&#x435;&#x437; &#x44D;&#x442;&#x43E;&#x442; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;;</p>

<p>- redirect = &#x43D;&#x430; &#x43A;&#x430;&#x43A;&#x443;&#x44E; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x447;&#x43A;&#x443; &#x43F;&#x435;&#x440;&#x435;&#x439;&#x442;&#x438; &#x432; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435; &#x43F;&#x440;&#x438;&#x43D;&#x44F;&#x442;&#x438;&#x44F; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x445; &#x444;&#x43E;&#x440;&#x43C;&#x44B;.</p>

<p>&#x41F;&#x435;&#x440;&#x435;&#x43D;&#x430;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x435; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x443;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x44C; &#x44F;&#x432;&#x43D;&#x43E; &#x432; &#x445;&#x44D;&#x448;&#x435; $faw &#x438;&#x43B;&#x438; &#x432; &#x445;&#x44D;&#x448;&#x435; config &#x438;&#x43B;&#x438; &#x43D;&#x435; &#x443;&#x43A;&#x430;&#x437;&#x44B;&#x432;&#x430;&#x442;&#x44C;, &#x438; &#x43F;&#x435;&#x440;&#x435;&#x439;&#x442;&#x438; &#x43A; &#x43A;&#x43E;&#x440;&#x43D;&#x435;&#x432;&#x43E;&#x439; &#x442;&#x43E;&#x447;&#x43A;&#x435; (&#x43F;&#x443;&#x442;&#x44C; &quot;/&quot; = &#x438;&#x43D;&#x434;&#x435;&#x43A;&#x441;&#x43D;&#x430;&#x44F; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x447;&#x43A;&#x430;).</p>

<p>- layout = &#x43E;&#x441;&#x43E;&#x431;&#x44B;&#x439; &#x43C;&#x430;&#x43A;&#x435;&#x442;, &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x44B;&#x439; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x431;&#x44B;&#x442;&#x44C; &#x43F;&#x435;&#x440;&#x435;&#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x451;&#x43D; &#x432;&#x43C;&#x435;&#x441;&#x442;&#x43E; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x43D;&#x43E;&#x433;&#x43E; &#x43C;&#x430;&#x43A;&#x435;&#x442;&#x430; &#x434;&#x43B;&#x44F; &#x432;&#x44B;&#x432;&#x43E;&#x434;&#x430; &#x444;&#x43E;&#x440;&#x43C;&#x44B;. &#x421;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x43D;&#x44B;&#x439; &#x43C;&#x430;&#x43A;&#x435;&#x442; &#x437;&#x430;&#x434;&#x430;&#x451;&#x442;&#x441;&#x44F; &#x432; &#x43A;&#x43E;&#x43D;&#x444;&#x438;&#x433;&#x443;&#x440;&#x430;&#x446;&#x438;&#x43E;&#x43D;&#x43D;&#x43E;&#x43C; &#x444;&#x430;&#x439;&#x43B;&#x435; &#x441; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; &#x434;&#x438;&#x440;&#x435;&#x43A;&#x442;&#x438;&#x432;&#x44B; layout.</p>

<p>&#x41F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440; &quot;action&quot; &#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x438;&#x442;&#x441;&#x44F; &#x43D;&#x435;&#x43E;&#x431;&#x44F;&#x437;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x43C; (&#x437;&#x430;&#x434;&#x430;&#x451;&#x442; &#x442;&#x43E;&#x447;&#x43A;&#x443; &#x441;&#x430;&#x439;&#x442;&#x430;, &#x43D;&#x430; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x443;&#x44E; &#x431;&#x443;&#x434;&#x443;&#x442; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x432;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x435; &#x444;&#x43E;&#x440;&#x43C;&#x44B;), &#x43F;&#x43E;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x443; &#x43E;&#x43D; &#x430;&#x432;&#x442;&#x43E;&#x43C;&#x430;&#x442;&#x438;&#x447;&#x435;&#x441;&#x43A;&#x438; &#x43F;&#x43E;&#x434;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x43F;&#x440;&#x438; &#x432;&#x44B;&#x437;&#x43E;&#x432;&#x435; &#x43C;&#x435;&#x442;&#x43E;&#x434;&#x43E;&#x432; get/post.</p>

<p>&#x415;&#x441;&#x43B;&#x438; &#x432;&#x44B;&#x437;&#x43E;&#x432; &#x444;&#x43E;&#x440;&#x43C;&#x44B; &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x44F;&#x43B;&#x441;&#x44F; &#x441; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; &#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441;&#x430; GET, &#x442;&#x43E; &#x44D;&#x442;&#x43E; &#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;, &#x447;&#x442;&#x43E; &#x44D;&#x442;&#x430; &#x444;&#x43E;&#x440;&#x43C;&#x430; &#x43D;&#x43E;&#x432;&#x430;&#x44F;, &#x438; &#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x439; &#x43D;&#x430;&#x434; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x43C;&#x438; (&#x438;&#x437;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x438;&#x435; &#x43F;&#x43E;&#x43B;&#x435;&#x439;) &#x43D;&#x435; &#x43F;&#x440;&#x43E;&#x438;&#x437;&#x432;&#x43E;&#x434;&#x438;&#x43B;&#x43E;&#x441;&#x44C;.</p>

<p>&#x41F;&#x440;&#x438; &#x43D;&#x430;&#x441;&#x442;&#x440;&#x43E;&#x439;&#x43A;&#x435; &#x444;&#x43E;&#x440;&#x43C;&#x44B; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x443;&#x43A;&#x430;&#x437;&#x430;&#x442;&#x44C; &#x441;&#x432;&#x43E;&#x451; &#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x435; &#x434;&#x43B;&#x44F; &#x432;&#x430;&#x440;&#x438;&#x430;&#x43D;&#x442;&#x430; GET, &#x430; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x43E;&#x431;&#x449;&#x443;&#x44E; &#x442;&#x43E;&#x447;&#x43A;&#x443; before.</p>

<p>&#x412;&#x43E; &#x432;&#x442;&#x43E;&#x440;&#x43E;&#x43C; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435; &#x43C;&#x44B; &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x44F;&#x435;&#x43C; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x441;&#x43A;&#x43E;&#x435; &#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x435; before &#x434;&#x43E; &#x43E;&#x442;&#x440;&#x438;&#x441;&#x43E;&#x432;&#x43A;&#x438; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x430; &#x438; &#x432;&#x44B;&#x437;&#x44B;&#x432;&#x430;&#x435;&#x43C; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x441;&#x43A;&#x43E;&#x435; &#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x435; after &#x43F;&#x43E;&#x441;&#x43B;&#x435; &#x435;&#x433;&#x43E; &#x43E;&#x442;&#x440;&#x438;&#x441;&#x43E;&#x432;&#x43A;&#x438;.</p>

<p>&#x412;&#x43D;&#x438;&#x43C;&#x430;&#x43D;&#x438;&#x435;! &#x43F;&#x435;&#x440;&#x432;&#x44B;&#x439; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440; &#x434;&#x43B;&#x44F; &#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x44F; &#x438; before &#x438; after - &#x442;&#x438;&#x43F; &#x437;&#x430;&#x43F;&#x440;&#x43E;&#x441;&#x430; GET/POST.</p>

<p>&#x410; &#x432;&#x43E;&#x442; &#x432;&#x442;&#x43E;&#x440;&#x43E;&#x439; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440; &#x437;&#x430;&#x432;&#x438;&#x441;&#x438;&#x442; &#x43E;&#x442; &#x442;&#x438;&#x43F;&#x430; &#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x44F;. &#x412; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435; before - &#x44D;&#x442;&#x43E; &#x445;&#x44D;&#x448; &#x43D;&#x430; &#x43E;&#x431;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A; &#x444;&#x43E;&#x440;&#x43C;&#x44B;, &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C; FAW::Form. &#x42D;&#x442;&#x43E; &#x434;&#x435;&#x43B;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x434;&#x43B;&#x44F; &#x442;&#x43E;&#x433;&#x43E;, &#x447;&#x442;&#x43E;&#x431;&#x44B; &#x432; &#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x438; before &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x431;&#x44B;&#x43B;&#x43E; &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x438;&#x442;&#x44C; &#x43B;&#x43E;&#x433;&#x438;&#x43A;&#x443; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x44B;, &#x43E;&#x431;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x430;&#x442;&#x44C; &#x438;&#x43B;&#x438; &#x441;&#x43E;&#x43F;&#x43E;&#x441;&#x442;&#x430;&#x432;&#x438;&#x442;&#x44C; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x435; &#x438; &#x442;.&#x43F;. &#x412; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435; &#x436;&#x435; GET after - &#x44D;&#x442;&#x43E; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;, &#x430; &#x432; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435; POST after - &#x442;&#x43E;&#x436;&#x435; &#x441;&#x441;&#x44B;&#x43B;&#x43A;&#x430; &#x43D;&#x430; FAW::Form.</p>

<p>&#x422;&#x430;&#x43A;&#x43E;&#x435; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x438;&#x435; &#x43E;&#x431;&#x44A;&#x44F;&#x441;&#x43D;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x43E;&#x447;&#x435;&#x43D;&#x44C; &#x43F;&#x440;&#x43E;&#x441;&#x442;&#x43E;. &#x414;&#x43B;&#x44F; &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x434;&#x443;&#x440;&#x44B; GET after &#x43B;&#x43E;&#x433;&#x438;&#x43A;&#x430; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x44B; &#x43D;&#x435; &#x432;&#x430;&#x436;&#x43D;&#x430;, &#x43D;&#x43E; &#x43D;&#x430;&#x43C; &#x43C;&#x43E;&#x436;&#x435;&#x442; &#x43F;&#x43E;&#x442;&#x440;&#x435;&#x431;&#x43E;&#x432;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x438;&#x437;&#x43C;&#x435;&#x43D;&#x435;&#x43D;&#x438;&#x435; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x430;. &#x410; &#x432;&#x43E;&#x442; &#x432; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435; POST after &#x43D;&#x430;&#x43C; &#x43A;&#x440;&#x430;&#x439;&#x43D;&#x435; &#x432;&#x430;&#x436;&#x43D;&#x43E; &#x438;&#x43C;&#x435;&#x442;&#x44C; &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E;&#x441;&#x442;&#x44C; &#x443;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x44F;&#x442;&#x44C; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x438;&#x435;&#x43C; &#x444;&#x43E;&#x440;&#x43C;&#x44B;, &#x432; &#x447;&#x430;&#x441;&#x442;&#x43D;&#x43E;&#x441;&#x442;&#x438;, &#x435;&#x451; &#x43F;&#x435;&#x440;&#x435;&#x445;&#x43E;&#x434;&#x430;&#x43C;&#x438;.</p>

<p>&#x41F;&#x43E;&#x44D;&#x442;&#x43E;&#x43C;&#x443; &#x441;&#x442;&#x430;&#x43D;&#x434;&#x430;&#x440;&#x442;&#x43D;&#x44B;&#x439; &#x43E;&#x431;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A; POST &#x43D;&#x435;&#x441;&#x43A;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x441;&#x43B;&#x43E;&#x436;&#x43D;&#x435;&#x435;, &#x447;&#x435;&#x43C; GET.</p>

<p>&#x414;&#x43B;&#x44F; &#x43D;&#x430;&#x447;&#x430;&#x43B;&#x430; &#x43D;&#x430;&#x43C; &#x441;&#x43B;&#x435;&#x434;&#x443;&#x435;&#x442; &#x441;&#x43E;&#x43F;&#x43E;&#x441;&#x442;&#x430;&#x432;&#x438;&#x442;&#x44C; &#x43F;&#x43E;&#x43B;&#x443;&#x447;&#x435;&#x43D;&#x43D;&#x44B;&#x435; &#x43D;&#x430; &#x43F;&#x440;&#x435;&#x434;&#x44B;&#x434;&#x443;&#x449;&#x435;&#x43C; &#x44D;&#x442;&#x430;&#x43F;&#x435; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x435; &#x432; &#x43F;&#x43E;&#x43B;&#x44F; &#x444;&#x43E;&#x440;&#x43C;&#x44B; - &#x432;&#x434;&#x440;&#x443;&#x433;, &#x43C;&#x44B; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x443;&#x43C;&#x430;&#x435;&#x43C; &#x43F;&#x435;&#x440;&#x435;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x44C; &#x43A;&#x443;&#x434;&#x430;-&#x43B;&#x438;&#x431;&#x43E;, &#x438; &#x43F;&#x43E;&#x442;&#x440;&#x435;&#x431;&#x443;&#x435;&#x43C; &#x443; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44F; &#x43F;&#x43E;&#x43F;&#x440;&#x430;&#x432;&#x438;&#x442;&#x44C; &#x441;&#x435;&#x431;&#x44F;.</p>

<p>&#x417;&#x430;&#x442;&#x435;&#x43C; &#x43D;&#x430;&#x43C; &#x441;&#x43B;&#x435;&#x434;&#x443;&#x435;&#x442; &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x438;&#x442;&#x44C; &#x432;&#x430;&#x43B;&#x438;&#x434;&#x430;&#x446;&#x438;&#x44E; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x445; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44F;, &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x44B;&#x432;&#x430;&#x44F;&#x441;&#x44C; &#x43D;&#x430; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x430;&#x445; &#x441;&#x435;&#x43A;&#x446;&#x438;&#x438; validate &#x43E;&#x43F;&#x438;&#x441;&#x430;&#x43D;&#x438;&#x44F; &#x444;&#x43E;&#x440;&#x43C;&#x44B; &#x438; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x44F; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C; validate.</p>

<p>&#x418; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x43F;&#x43E;&#x441;&#x43B;&#x435; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x43C;&#x44B; &#x43C;&#x43E;&#x436;&#x435;&#x43C; &#x432;&#x44B;&#x437;&#x432;&#x430;&#x442;&#x44C; &#x43F;&#x440;&#x435;&#x434;&#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x451;&#x43D;&#x43D;&#x43E;&#x435; &#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x435; before POST (&#x435;&#x441;&#x43B;&#x438;, &#x43A;&#x43E;&#x43D;&#x435;&#x447;&#x43D;&#x43E;, &#x43E;&#x43D;&#x43E; &#x431;&#x44B;&#x43B;&#x43E; &#x43F;&#x440;&#x435;&#x434;&#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x435;&#x43D;&#x43E;).</p>

<p>&#x414;&#x430;&#x43B;&#x44C;&#x43D;&#x435;&#x439;&#x448;&#x435;&#x435; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x438;&#x435; &#x441;&#x438;&#x43B;&#x44C;&#x43D;&#x43E; &#x437;&#x430;&#x432;&#x438;&#x441;&#x438;&#x442; &#x43E;&#x442; &#x442;&#x43E;&#x433;&#x43E;, &#x431;&#x44B;&#x43B;&#x430; &#x43B;&#x438; &#x443;&#x441;&#x43F;&#x435;&#x448;&#x43D;&#x43E;&#x439; &#x432;&#x441;&#x442;&#x440;&#x43E;&#x435;&#x43D;&#x43D;&#x430;&#x44F; &#x432;&#x430;&#x43B;&#x438;&#x434;&#x430;&#x446;&#x438;&#x44F;. &#x415;&#x441;&#x43B;&#x438; &#x44D;&#x442;&#x43E; &#x442;&#x430;&#x43A;, &#x442;&#x43E; &#x43C;&#x44B; &#x441;&#x43E; &#x441;&#x43F;&#x43E;&#x43A;&#x43E;&#x439;&#x43D;&#x43E;&#x439; &#x441;&#x43E;&#x432;&#x435;&#x441;&#x442;&#x44C;&#x44E; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x451;&#x43C; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x435; &#x432; &#x43E;&#x431;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A; after POST (&#x447;&#x442;&#x43E;&#x431;&#x44B; &#x438;&#x445; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x431;&#x44B;&#x43B;&#x43E; &#x432;&#x441;&#x442;&#x430;&#x432;&#x438;&#x442;&#x44C; &#x432; &#x411;&#x414;) &#x438; &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x44F;&#x435;&#x43C; &#x43F;&#x435;&#x440;&#x435;&#x445;&#x43E;&#x434; &#x432; &#x437;&#x430;&#x440;&#x430;&#x43D;&#x435;&#x435; &#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x451;&#x43D;&#x43D;&#x443;&#x44E; &#x442;&#x43E;&#x447;&#x43A;&#x443; (&#x43D;&#x43E; &#x442;&#x43E;&#x43B;&#x44C;&#x43A;&#x43E; &#x435;&#x441;&#x43B;&#x438; &#x43E;&#x431;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A; after POST) &#x432;&#x435;&#x440;&#x43D;&#x443;&#x43B; &#x441;&#x442;&#x430;&#x442;&#x443;&#x441; &#x443;&#x441;&#x43F;&#x435;&#x448;&#x43D;&#x43E;&#x433;&#x43E; &#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x44F; (1 &#x43D;&#x430; &#x432;&#x44B;&#x445;&#x43E;&#x434;&#x435;). &#x418;&#x43D;&#x430;&#x447;&#x435; - &#x430;&#x434;&#x42A;, &#x43C;&#x44B; &#x43D;&#x435; &#x438;&#x43C;&#x435;&#x435;&#x43C; &#x43F;&#x440;&#x430;&#x432;&#x430; &#x443;&#x439;&#x442;&#x438; &#x438;&#x437; &#x444;&#x43E;&#x440;&#x43C;&#x44B;. &#x412;&#x434;&#x440;&#x443;&#x433;, &#x442;&#x430;&#x43C; &#x43E;&#x448;&#x438;&#x431;&#x43A;&#x430; - &#x431;&#x430;&#x437;&#x430; &#x43E;&#x442;&#x432;&#x430;&#x43B;&#x438;&#x43B;&#x430;&#x441;&#x44C; &#x438;&#x43B;&#x438; &#x447;&#x442;&#x43E; &#x435;&#x449;&#x451; &#x43F;&#x440;&#x43E;&#x438;&#x437;&#x43E;&#x448;&#x43B;&#x43E;...</p>

<p>&#x41A;&#x441;&#x442;&#x430;&#x442;&#x438;, &#x432;&#x44B;&#x445;&#x43E;&#x434; &#x438;&#x437; &#x444;&#x43E;&#x440;&#x43C;&#x44B; &#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x44F;&#x435;&#x442;&#x441;&#x44F; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x43E;&#x43C; redirect &#x432; &#x43D;&#x430;&#x441;&#x442;&#x440;&#x43E;&#x439;&#x43A;&#x430;&#x445; &#x444;&#x43E;&#x440;&#x43C;&#x44B;. &#x410; &#x432;&#x43E;&#x442; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440; action &#x432; &#x441;&#x430;&#x43C;&#x43E;&#x439; &#x444;&#x43E;&#x440;&#x43C;&#x435; &#x43E;&#x442;&#x432;&#x435;&#x447;&#x430;&#x435;&#x442; &#x437;&#x430; &#x442;&#x43E;, &#x43A;&#x443;&#x434;&#x430; &#x434;&#x43E;&#x43B;&#x436;&#x43D;&#x44B; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x432;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x435; &#x444;&#x43E;&#x440;&#x43C;&#x44B; &#x434;&#x43B;&#x44F; &#x432;&#x430;&#x43B;&#x438;&#x434;&#x430;&#x446;&#x438;&#x438; &#x438; &#x43E;&#x431;&#x44F;&#x437;&#x430;&#x43D; &#x441;&#x43E;&#x432;&#x43F;&#x430;&#x434;&#x430;&#x442;&#x44C; &#x441; &#x442;&#x435;&#x43A;&#x443;&#x449;&#x438;&#x43C; &#x43F;&#x443;&#x442;&#x451;&#x43C; &#x444;&#x43E;&#x440;&#x43C;&#x44B;.</p>

<p>... &#x438; &#x43C;&#x44B; &#x434;&#x43E;&#x43B;&#x436;&#x43D;&#x44B; &#x432;&#x435;&#x440;&#x43D;&#x443;&#x442;&#x44C;&#x441;&#x44F; &#x43A; &#x444;&#x43E;&#x440;&#x43C;&#x435;, &#x43E;&#x442;&#x440;&#x438;&#x441;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x435;&#x451; &#x438; &#x441;&#x43E;&#x43E;&#x431;&#x449;&#x438;&#x442;&#x44C; &#x43E;&#x431; &#x44D;&#x442;&#x43E;&#x439; &#x43E;&#x448;&#x438;&#x431;&#x43A;&#x435;.</p>

<p>&#x422;&#x43E; &#x435;&#x441;&#x442;&#x44C;, &#x43C;&#x44B; &#x440;&#x435;&#x43D;&#x434;&#x435;&#x440;&#x438;&#x43C; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D; &#x438; &#x432;&#x43E;&#x437;&#x432;&#x440;&#x430;&#x449;&#x430;&#x435;&#x43C;&#x441;&#x44F; &#x43A; &#x43D;&#x43E;&#x440;&#x43C;&#x430;&#x43B;&#x44C;&#x43D;&#x43E;&#x439; (&#x448;&#x442;&#x430;&#x442;&#x43D;&#x43E;&#x439;) &#x440;&#x430;&#x431;&#x43E;&#x442;&#x435; &#x441; &#x444;&#x43E;&#x440;&#x43C;&#x43E;&#x439;.</p>

<p>&#x421;&#x43E; &#x441;&#x442;&#x43E;&#x440;&#x43E;&#x43D;&#x44B; &#x440;&#x430;&#x437;&#x440;&#x430;&#x431;&#x43E;&#x442;&#x447;&#x438;&#x43A;&#x430; &#x432; &#x43D;&#x430;&#x438;&#x431;&#x43E;&#x43B;&#x435;&#x435; &#x442;&#x438;&#x43F;&#x438;&#x447;&#x43D;&#x43E;&#x43C; &#x441;&#x43B;&#x443;&#x447;&#x430;&#x435; &#x43E;&#x441;&#x442;&#x430;&#x451;&#x442;&#x441;&#x44F; &#x432;&#x43E;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C;&#x441;&#x44F; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x435;&#x43C; &#x441;&#x43B;&#x435;&#x434;&#x443;&#x44E;&#x449;&#x438;&#x43C; &#x43E;&#x431;&#x440;&#x430;&#x437;&#x43E;&#x43C;:</p>

<p>- &#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x438;&#x442;&#x44C; &#x43F;&#x43E;&#x43B;&#x44F; &#x444;&#x43E;&#x440;&#x43C;&#x44B; &#x441;&#x43E;&#x433;&#x43B;&#x430;&#x441;&#x43D;&#x43E; FAW::Form &#x438; FAW::Elements;</p>

<p>- &#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x438;&#x442;&#x44C; &#x43A;&#x43D;&#x43E;&#x43F;&#x43A;&#x438; &#x444;&#x43E;&#x440;&#x43C;&#x44B; &#x441;&#x43E;&#x433;&#x43B;&#x430;&#x441;&#x43D;&#x43E; FAW::Form &#x438; FAW::Elements;</p>

<p>- &#x43E;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x44C; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x43E; before GET &#x43F;&#x440;&#x438; &#x432;&#x445;&#x43E;&#x436;&#x434;&#x435;&#x43D;&#x438;&#x438; &#x432; &#x444;&#x43E;&#x440;&#x43C;&#x443; (&#x441;&#x43E;&#x43F;&#x43E;&#x441;&#x442;&#x430;&#x432;&#x43B;&#x435;&#x43D;&#x438;&#x435; &#x438;&#x43C;&#x435;&#x44E;&#x449;&#x438;&#x445;&#x441;&#x44F; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x445; &#x438; &#x43F;&#x43E;&#x43B;&#x435;&#x439; &#x444;&#x43E;&#x440;&#x43C;&#x44B;);</p>

<p>- &#x43E;&#x43F;&#x438;&#x441;&#x430;&#x442;&#x44C; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;&#x43E; before POST &#x434;&#x43B;&#x44F; &#x432;&#x44B;&#x445;&#x43E;&#x434;&#x430; &#x438;&#x437; &#x444;&#x43E;&#x440;&#x43C;&#x44B; (&#x441;&#x43E;&#x445;&#x440;&#x430;&#x43D;&#x435;&#x43D;&#x438;&#x435; &#x434;&#x430;&#x43D;&#x43D;&#x44B;&#x445; &#x438;&#x43B;&#x438; &#x434;&#x43E;&#x43F;&#x43E;&#x43B;&#x43D;&#x438;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x435; &#x434;&#x435;&#x439;&#x441;&#x442;&#x432;&#x438;&#x44F; &#x441; &#x43E;&#x431;&#x44F;&#x437;&#x430;&#x442;&#x435;&#x43B;&#x44C;&#x43D;&#x44B;&#x43C; &#x43F;&#x43E;&#x434;&#x442;&#x432;&#x435;&#x440;&#x436;&#x434;&#x435;&#x43D;&#x438;&#x435;&#x43C; &#x443;&#x441;&#x43F;&#x435;&#x448;&#x43D;&#x43E;&#x441;&#x442;&#x438;);</p>

<h1 id="POD-ERRORS">POD ERRORS</h1>

<p>Hey! <b>The above document had some coding errors, which are explained below:</b></p>

<dl>

<dt id="Around-line-112:">Around line 112:</dt>
<dd>

<p>Unknown directive: =text</p>

</dd>
<dt id="Around-line-129:">Around line 129:</dt>
<dd>

<p>Unknown directive: =text</p>

</dd>
<dt id="Around-line-162:">Around line 162:</dt>
<dd>

<p>Unknown directive: =text</p>

</dd>
<dt id="Around-line-178:">Around line 178:</dt>
<dd>

<p>Unknown directive: =text</p>

</dd>
<dt id="Around-line-196:">Around line 196:</dt>
<dd>

<p>Unknown directive: =text</p>

</dd>
<dt id="Around-line-222:">Around line 222:</dt>
<dd>

<p>Unknown directive: =text</p>

</dd>
<dt id="Around-line-239:">Around line 239:</dt>
<dd>

<p>Unknown directive: =text</p>

</dd>
</dl>


</body>

</html>


