<?xml version="1.0" ?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<title></title>
<meta http-equiv="content-type" content="text/html; charset=utf-8" />
<link rev="made" href="mailto:kevin@archlinux.org" />
</head>

<body style="background-color: white">



<ul id="index">
  <li><a href="#NAME">NAME</a></li>
  <li><a href="#VERSION">VERSION</a></li>
  <li><a href="#SYNOPSIS">SYNOPSIS</a></li>
  <li><a href="#DESCRIPTION">DESCRIPTION</a>
    <ul>
      <li><a href="#rights">rights</a></li>
      <li><a href="#say_if_debug">say_if_debug</a></li>
      <li><a href="#history">history</a></li>
      <li><a href="#before">&#x445;&#x443;&#x43A; before</a></li>
      <li><a href="#before_template_render">&#x445;&#x443;&#x43A; before_template_render</a></li>
      <li><a href="#rights1">rights</a></li>
      <li><a href="#access_status">access_status</a></li>
      <li><a href="#access_deny">access_deny</a></li>
      <li><a href="#access_grant">access_grant</a></li>
    </ul>
  </li>
</ul>

<h1 id="NAME">NAME</h1>

<p>Dancer::Plugin::uRBAC - micro Role Based Access Control</p>

<h1 id="VERSION">VERSION</h1>

<p>0.2</p>

<h1 id="SYNOPSIS">SYNOPSIS</h1>

<p>&#x41E;&#x43F;&#x438;&#x448;&#x438;&#x442;&#x435; &#x43A;&#x43E;&#x43D;&#x444;&#x438;&#x433;&#x443;&#x440;&#x430;&#x446;&#x438;&#x44E; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x430; &#x43A; &#x440;&#x430;&#x437;&#x43B;&#x438;&#x447;&#x43D;&#x44B;&#x43C; &#x442;&#x43E;&#x447;&#x43A;&#x430;&#x43C;.</p>

<pre><code>    config.yml:
        ...
        plugins:
            uRBAC:
            roles:
                /: any
                /page/:url: any
                /page/:url/edit: admin
        ...</code></pre>

<p>&#x41F;&#x43E;&#x434;&#x43A;&#x43B;&#x44E;&#x447;&#x438;&#x442;&#x435; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44C;:</p>

<pre><code>    use Dancer::Plugin::uRBAC;</code></pre>

<p>&#x412; &#x43E;&#x431;&#x449;&#x435;&#x43C; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x435; &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x44F;&#x439;&#x442;&#x435; &#x43F;&#x440;&#x43E;&#x432;&#x435;&#x440;&#x43A;&#x443; &#x43F;&#x440;&#x430;&#x432; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x430; &#x438; &#x43E;&#x442;&#x440;&#x438;&#x441;&#x43E;&#x432;&#x43A;&#x443; &#x441;&#x442;&#x440;&#x430;&#x43D;&#x438;&#x447;&#x43A;&#x438; &#x437;&#x430;&#x43F;&#x440;&#x435;&#x449;&#x435;&#x43D;&#x438;&#x44F; (&#x434;&#x43B;&#x44F; TemplateToolkit):</p>

<pre><code>    [% IF deny_flag != 0; INCLUDE $deny_template; ELSE; content; END %]</code></pre>

<p>&#x412; &#x442;&#x435;&#x43B;&#x435; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x43D;&#x43E;&#x433;&#x43E; &#x43F;&#x440;&#x43E;&#x435;&#x43A;&#x442;&#x430; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x43F;&#x440;&#x43E;&#x432;&#x435;&#x440;&#x43A;&#x443; &#x440;&#x43E;&#x43B;&#x435;&#x439;...</p>

<pre><code>    get &#39;/&#39; =&gt; sub {
        ...
        if (rights(&#39;admin&#39;) {
            warning &quot; ::::::::::::::::: your are is admin&#39; rights&quot;;
        } else {
            warning &quot; ::::::::::::::::: your are isn&#39;t admin&quot;;
        }
        ...
    }</code></pre>

<p>... &#x438; &#x43C;&#x43E;&#x434;&#x438;&#x444;&#x438;&#x43A;&#x430;&#x446;&#x438;&#x44E; &#x43F;&#x440;&#x430;&#x432; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x430; &#x441;&#x43E;&#x433;&#x43B;&#x430;&#x441;&#x43D;&#x43E; &#x438;&#x43D;&#x43E;&#x439; &#x43B;&#x43E;&#x433;&#x438;&#x43A;&#x438;:</p>

<pre><code>    get &#39;/page/:url&#39; =&gt; sub {
        ...

        if ( foo ) {
            access_deny;
        } else {
            access_grant;
        }

    }</code></pre>

<p>&#x412; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x435; &#x432;&#x43E;&#x437;&#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x43F;&#x440;&#x43E;&#x432;&#x435;&#x440;&#x44F;&#x442;&#x44C; &#x43F;&#x440;&#x430;&#x432;&#x430; &#x442;&#x435;&#x43A;&#x443;&#x449;&#x435;&#x433;&#x43E; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44F; &#x441;&#x43B;&#x435;&#x434;&#x443;&#x44E;&#x449;&#x438;&#x43C; &#x43E;&#x431;&#x440;&#x430;&#x437;&#x43E;&#x43C;:</p>

<pre><code>    [% IF rights(admin) %]&lt;a href=&quot;modify&quot;&gt;&#x438;&#x437;&#x43C;&#x435;&#x43D;&#x438;&#x442;&#x44C; &#x441;&#x43E;&#x434;&#x435;&#x440;&#x436;&#x438;&#x43C;&#x43E;&#x435;&lt;/a&gt;[% END %]</code></pre>

<h1 id="DESCRIPTION">DESCRIPTION</h1>

<p>&#x41F;&#x43B;&#x430;&#x433;&#x438;&#x43D;, &#x434;&#x43E;&#x431;&#x430;&#x432;&#x43B;&#x44F;&#x44E;&#x449;&#x438;&#x439; &#x432; Dancer &#x444;&#x443;&#x43D;&#x43A;&#x446;&#x438;&#x43E;&#x43D;&#x430;&#x43B; &#x43A;&#x43E;&#x43D;&#x442;&#x440;&#x43E;&#x43B;&#x44F; &#x43D;&#x430; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x435; &#x440;&#x43E;&#x43B;&#x435;&#x439;.</p>

<p>&#x41F;&#x440;&#x438; &#x43F;&#x43E;&#x434;&#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x43D;&#x438;&#x438; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F; &#x443;&#x441;&#x442;&#x430;&#x43D;&#x430;&#x432;&#x43B;&#x438;&#x432;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x434;&#x432;&#x430; &#x445;&#x443;&#x43A;&#x430;: &#x43F;&#x435;&#x440;&#x435;&#x434; &#x432;&#x44B;&#x437;&#x43E;&#x432;&#x43E;&#x43C; &#x438; &#x43F;&#x440;&#x438; &#x43E;&#x442;&#x440;&#x438;&#x441;&#x43E;&#x432;&#x43A;&#x435; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x430;. &#x41A;&#x440;&#x43E;&#x43C;&#x435; &#x442;&#x43E;&#x433;&#x43E;, &#x443;&#x43F;&#x440;&#x430;&#x432;&#x43B;&#x44F;&#x442;&#x44C; &#x43F;&#x43E;&#x432;&#x435;&#x434;&#x435;&#x43D;&#x438;&#x435;&#x43C; &#x437;&#x430;&#x43F;&#x440;&#x435;&#x449;&#x435;&#x43D;&#x438;&#x44F; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x441; &#x43F;&#x43E;&#x43C;&#x43E;&#x449;&#x44C;&#x44E; &#x44D;&#x43A;&#x441;&#x43F;&#x43E;&#x440;&#x442;&#x438;&#x440;&#x443;&#x435;&#x43C;&#x44B;&#x445; &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x434;&#x443;&#x440;.</p>

<p>&#x41F;&#x440;&#x438; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x435; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x443;&#x44E;&#x442;&#x441;&#x44F; &#x441;&#x43B;&#x435;&#x434;&#x443;&#x44E;&#x449;&#x438;&#x435; &#x432;&#x43D;&#x435;&#x448;&#x43D;&#x438;&#x435; &#x442;&#x43E;&#x447;&#x43A;&#x438; &#x438; &#x441;&#x43E;&#x433;&#x43B;&#x430;&#x448;&#x435;&#x43D;&#x438;&#x44F;:</p>

<p>- session-&gt;{user}-&gt;{roles} &#x445;&#x440;&#x430;&#x43D;&#x438;&#x442; &#x441;&#x43F;&#x438;&#x441;&#x43E;&#x43A; &#x440;&#x43E;&#x43B;&#x435;&#x439; &#x442;&#x435;&#x43A;&#x443;&#x449;&#x435;&#x433;&#x43E; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44F;;</p>

<p>- &#x435;&#x441;&#x43B;&#x438; &#x440;&#x43E;&#x43B;&#x44C; &#x43D;&#x435; &#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x435;&#x43D;&#x430;, &#x43E;&#x43D;&#x430; &#x441;&#x447;&#x438;&#x442;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x433;&#x43E;&#x441;&#x442;&#x435;&#x432;&#x43E;&#x439; (guest);</p>

<p>- &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D; &#x437;&#x430;&#x43F;&#x440;&#x435;&#x449;&#x435;&#x43D;&#x438;&#x44F; &#x43D;&#x430;&#x445;&#x43E;&#x434;&#x438;&#x442;&#x441;&#x44F; &#x432; views/components/defdeny.tt;</p>

<p>- &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D; &#x437;&#x430;&#x43F;&#x440;&#x435;&#x449;&#x435;&#x43D;&#x438;&#x44F; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x43E;&#x43F;&#x440;&#x435;&#x434;&#x435;&#x43B;&#x438;&#x442;&#x44C; &#x43E;&#x43F;&#x446;&#x438;&#x435;&#x439; deny_template &#x432; &#x43A;&#x43E;&#x43D;&#x444;&#x438;&#x433;&#x435; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F;;</p>

<p>- &#x43F;&#x440;&#x43E;&#x432;&#x435;&#x440;&#x44F;&#x442;&#x44C; &#x43F;&#x440;&#x430;&#x432;&#x430; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x43F;&#x440;&#x44F;&#x43C;&#x43E; &#x432; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x438;&#x437;&#x430;&#x442;&#x43E;&#x440;&#x435;, &#x434;&#x43B;&#x44F; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x432; &#x43D;&#x435;&#x433;&#x43E; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x451;&#x442;&#x441;&#x44F; &#x441;&#x441;&#x44B;&#x43B;&#x43A;&#x430; &#x43D;&#x430; &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x434;&#x443;&#x440;&#x443; rights;</p>

<h2 id="rights">rights</h2>

<p>&#x421;&#x435;&#x440;&#x434;&#x446;&#x435; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F; - &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x434;&#x443;&#x440;&#x430; &#x43F;&#x440;&#x43E;&#x432;&#x435;&#x440;&#x43A;&#x438; &#x43F;&#x440;&#x430;&#x432; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x430;. &#x41D;&#x430; &#x432;&#x445;&#x43E;&#x434;&#x435; &#x43D;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x451;&#x442;&#x441;&#x44F; &#x43D;&#x438;&#x43A;&#x430;&#x43A;&#x438;&#x445; &#x43F;&#x430;&#x440;&#x430;&#x43C;&#x435;&#x442;&#x440;&#x43E;&#x432;, &#x430; &#x43D;&#x430; &#x432;&#x44B;&#x445;&#x43E;&#x434;&#x435; &#x432;&#x43E;&#x437;&#x432;&#x440;&#x430;&#x449;&#x430;&#x435;&#x442;&#x441;&#x44F; 1, &#x435;&#x441;&#x43B;&#x438; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F; &#x437;&#x430;&#x43F;&#x440;&#x435;&#x449;&#x430;&#x435;&#x442;&#x441;&#x44F; &#x438;&#x43B;&#x438; undef, &#x435;&#x441;&#x43B;&#x438; &#x440;&#x430;&#x437;&#x440;&#x435;&#x448;&#x430;&#x435;&#x442;&#x441;&#x44F;</p>

<h2 id="say_if_debug">say_if_debug</h2>

<p>&#x414;&#x43B;&#x44F; &#x443;&#x434;&#x43E;&#x431;&#x441;&#x442;&#x432;&#x430; &#x43E;&#x442;&#x43B;&#x430;&#x434;&#x43A;&#x438; &#x437;&#x430;&#x432;&#x438;&#x441;&#x438;&#x43C;&#x44B;&#x439; &#x43E;&#x442; &#x444;&#x43B;&#x430;&#x433;&#x430; &#x43E;&#x442;&#x43B;&#x430;&#x434;&#x43A;&#x438; &#x432;&#x44B;&#x432;&#x43E;&#x434; &#x444;&#x43B;&#x430;&#x433;&#x430; &#x43E;&#x442;&#x43B;&#x430;&#x434;&#x43A;&#x438;</p>

<h2 id="history">history</h2>

<p>&#x417;&#x430;&#x43F;&#x438;&#x441;&#x44C; &#x438;&#x441;&#x442;&#x43E;&#x440;&#x438;&#x438; &#x43F;&#x43E;&#x441;&#x435;&#x449;&#x435;&#x43D;&#x438;&#x44F; &#x432; &#x43B;&#x43E;&#x433;. &#x415;&#x441;&#x43B;&#x438; &#x443;&#x43A;&#x430;&#x437;&#x430;&#x43D; &#x43A;&#x43E;&#x43C;&#x43C;&#x435;&#x43D;&#x442;&#x430;&#x440;&#x438;&#x439;, &#x442;&#x43E; &#x43F;&#x438;&#x448;&#x435;&#x43C; &#x438;&#x441;&#x442;&#x43E;&#x440;&#x438;&#x44E; &#x43D;&#x435; &#x432; &#x43B;&#x43E;&#x433;, &#x430; &#x432; &#x442;&#x430;&#x431;&#x43B;&#x438;&#x446;&#x443; &#x411;&#x414;.</p>

<h2 id="before">&#x445;&#x443;&#x43A; before</h2>

<p>&#x41E;&#x441;&#x43D;&#x43E;&#x432;&#x43D;&#x43E;&#x439; &#x43C;&#x435;&#x445;&#x430;&#x43D;&#x438;&#x437;&#x43C; &#x443;&#x441;&#x442;&#x430;&#x43D;&#x43E;&#x432;&#x43A;&#x438; &#x43F;&#x440;&#x430;&#x432; &#x43D;&#x430; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x435; &#x43A;&#x43E;&#x43D;&#x444;&#x438;&#x433;&#x443;&#x440;&#x430;&#x446;&#x438;&#x438; &#x438; &#x43F;&#x440;&#x430;&#x432;&#x438;&#x43B;.</p>

<p>&#x41F;&#x435;&#x440;&#x435;&#x434; &#x432;&#x44B;&#x437;&#x43E;&#x432;&#x43E;&#x43C; &#x43B;&#x43E;&#x433;&#x438;&#x43A;&#x438; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x44B; &#x43A;&#x430;&#x436;&#x434;&#x43E;&#x439; &#x442;&#x43E;&#x447;&#x43A;&#x438; &#x43C;&#x44B; &#x438;&#x43D;&#x438;&#x446;&#x438;&#x438;&#x440;&#x443;&#x435;&#x43C; &#x431;&#x430;&#x437;&#x43E;&#x432;&#x44B;&#x435; &#x43F;&#x435;&#x440;&#x435;&#x43C;&#x435;&#x43D;&#x43D;&#x44B;&#x435;. &#x41D;&#x430; &#x43E;&#x441;&#x43D;&#x43E;&#x432;&#x435; &#x432;&#x43D;&#x435;&#x448;&#x43D;&#x435;&#x433;&#x43E; &#x43C;&#x43E;&#x434;&#x443;&#x43B;&#x44F; FAW::uRoles &#x438; &#x43A;&#x43E;&#x43D;&#x444;&#x438;&#x433;&#x443;&#x440;&#x430;&#x446;&#x438;&#x438; config.yaml &#x43C;&#x44B; &#x432;&#x44B;&#x43F;&#x43E;&#x43B;&#x43D;&#x44F;&#x435;&#x43C; &#x43F;&#x440;&#x43E;&#x432;&#x435;&#x440;&#x43A;&#x438; &#x43F;&#x440;&#x430;&#x432; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x430; &#x442;&#x435;&#x43A;&#x443;&#x449;&#x435;&#x433;&#x43E; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44F; &#x43A; &#x442;&#x435;&#x43A;&#x443;&#x449;&#x435;&#x439; &#x442;&#x43E;&#x447;&#x43A;&#x435; &#x438; &#x443;&#x441;&#x442;&#x430;&#x43D;&#x430;&#x432;&#x43B;&#x438;&#x432;&#x430;&#x435;&#x43C; &#x444;&#x43B;&#x430;&#x433; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x430;.</p>

<h2 id="before_template_render">&#x445;&#x443;&#x43A; before_template_render</h2>

<p>&#x414;&#x43B;&#x44F; &#x43A;&#x43E;&#x440;&#x440;&#x435;&#x43A;&#x442;&#x43D;&#x43E;&#x439; &#x440;&#x430;&#x431;&#x43E;&#x442;&#x44B; &#x441; &#x43F;&#x440;&#x430;&#x432;&#x430;&#x43C;&#x438; &#x432; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x438;&#x437;&#x430;&#x442;&#x43E;&#x440;&#x435; &#x43C;&#x44B; &#x434;&#x43E;&#x43B;&#x436;&#x43D;&#x44B; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x442;&#x44C; &#x442;&#x443;&#x434;&#x430; &#x442;&#x435;&#x43A;&#x443;&#x449;&#x435;&#x435; &#x441;&#x43E;&#x441;&#x442;&#x43E;&#x44F;&#x43D;&#x438;&#x435; &#x444;&#x43B;&#x430;&#x433;&#x430; &#x437;&#x430;&#x43F;&#x440;&#x435;&#x449;&#x435;&#x43D;&#x438;&#x44F;, &#x430;&#x434;&#x440;&#x435;&#x441; &#x448;&#x430;&#x431;&#x43B;&#x43E;&#x43D;&#x430; &#x441; &#x442;&#x435;&#x43A;&#x441;&#x442;&#x43E;&#x43C; &#x437;&#x430;&#x43F;&#x440;&#x435;&#x449;&#x435;&#x43D;&#x438;&#x44F; &#x438; &#x441;&#x441;&#x44B;&#x43B;&#x43A;&#x443; &#x43D;&#x430; &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x434;&#x443;&#x440;&#x443; &#x43F;&#x440;&#x430;&#x432; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x430;.</p>

<h2 id="rights1">rights</h2>

<p>&#x41F;&#x440;&#x43E;&#x432;&#x435;&#x440;&#x438;&#x442;&#x44C; &#x43F;&#x440;&#x430;&#x432;&#x430; &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x430; &#x442;&#x435;&#x43A;&#x443;&#x449;&#x435;&#x433;&#x43E; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44F; &#x43A; &#x442;&#x435;&#x43A;&#x443;&#x449;&#x435;&#x43C;&#x443; &#x43A;&#x43E;&#x43D;&#x442;&#x435;&#x43D;&#x442;&#x443; &#x43C;&#x43E;&#x436;&#x43D;&#x43E; &#x438; &#x43F;&#x440;&#x44F;&#x43C;&#x43E; &#x432; &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x434;&#x443;&#x440;&#x435; &#x43A;&#x43E;&#x43D;&#x442;&#x435;&#x43D;&#x442;&#x430;, &#x434;&#x43B;&#x44F; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x440;&#x435;&#x433;&#x438;&#x441;&#x442;&#x440;&#x438;&#x440;&#x443;&#x435;&#x442;&#x441;&#x44F; &#x43A;&#x43B;&#x44E;&#x447;&#x435;&#x432;&#x43E;&#x435; &#x441;&#x43B;&#x43E;&#x432;&#x43E; rights.</p>

<p>&#x41D;&#x430; &#x432;&#x445;&#x43E;&#x434;&#x435; &#x441;&#x43B;&#x435;&#x434;&#x443;&#x435;&#x442; &#x43F;&#x435;&#x440;&#x435;&#x434;&#x430;&#x442;&#x44C; &#x43D;&#x430;&#x437;&#x432;&#x430;&#x43D;&#x438;&#x435; &#x440;&#x43E;&#x43B;&#x438;, &#x43D;&#x430; &#x43A;&#x43E;&#x442;&#x43E;&#x440;&#x443;&#x44E; &#x441;&#x43B;&#x435;&#x434;&#x443;&#x435;&#x442; &#x43F;&#x440;&#x43E;&#x432;&#x435;&#x440;&#x438;&#x442;&#x44C; &#x442;&#x435;&#x43A;&#x443;&#x449;&#x435;&#x433;&#x43E; &#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x435;&#x43B;&#x44F;.</p>

<pre><code>    my $currights = rights(&#39;admin);</code></pre>

<p>&#x41F;&#x440;&#x43E;&#x432;&#x435;&#x440;&#x43A;&#x430; &#x43D;&#x435; &#x43C;&#x435;&#x43D;&#x44F;&#x435;&#x442; &#x442;&#x435;&#x43A;&#x443;&#x449;&#x438;&#x439; &#x441;&#x442;&#x430;&#x442;&#x443;&#x441;. &#x414;&#x43B;&#x44F; &#x44D;&#x442;&#x43E;&#x433;&#x43E; &#x441;&#x43B;&#x435;&#x434;&#x443;&#x435;&#x442; &#x438;&#x441;&#x43F;&#x43E;&#x43B;&#x44C;&#x437;&#x43E;&#x432;&#x430;&#x442;&#x44C; &#x434;&#x440;&#x443;&#x433;&#x438;&#x435; &#x43F;&#x440;&#x43E;&#x446;&#x435;&#x434;&#x443;&#x440;&#x44B;.</p>

<h2 id="access_status">access_status</h2>

<p>&#x417;&#x430;&#x43F;&#x440;&#x43E;&#x441;&#x438;&#x442;&#x44C; &#x442;&#x435;&#x43A;&#x443;&#x449;&#x438;&#x439; &#x441;&#x442;&#x430;&#x442;&#x443;&#x441; (&#x432;&#x43E;&#x437;&#x432;&#x440;&#x430;&#x449;&#x430;&#x435;&#x442; &#x442;&#x435;&#x43A;&#x443;&#x449;&#x438;&#x439; &#x441;&#x442;&#x430;&#x442;&#x443;&#x441;: 1 = &#x431;&#x43B;&#x43E;&#x43A;&#x438;&#x440;&#x443;&#x435;&#x442;&#x441;&#x44F;, 0 = &#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F;&#x43D;&#x43E;).</p>

<h2 id="access_deny">access_deny</h2>

<p>&#x41D;&#x430;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x44C; &#x441;&#x442;&#x430;&#x442;&#x443;&#x441; &quot;&#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F; &#x437;&#x430;&#x431;&#x43B;&#x43E;&#x43A;&#x438;&#x440;&#x43E;&#x432;&#x430;&#x43D;&quot;.</p>

<h2 id="access_grant">access_grant</h2>

<p>&#x41D;&#x430;&#x437;&#x43D;&#x430;&#x447;&#x438;&#x442;&#x44C; &#x441;&#x442;&#x430;&#x442;&#x443;&#x441; &quot;&#x434;&#x43E;&#x441;&#x442;&#x443;&#x43F; &#x440;&#x430;&#x437;&#x440;&#x435;&#x448;&#x451;&#x43D;&quot;.</p>


</body>

</html>


